
/***************************************************************************************
  * ±¾³ÌÐòÓÉ½­Ð­¿Æ¼¼´´½¨²¢Ãâ·Ñ¿ªÔ´¹²Ïí
  * Äã¿ÉÒÔÈÎÒâ²é¿´¡¢Ê¹ÓÃºÍÐÞ¸Ä£¬²¢Ó¦ÓÃµ½×Ô¼ºµÄÏîÄ¿Ö®ÖÐ
  * ³ÌÐò°æÈ¨¹é½­Ð­¿Æ¼¼ËùÓÐ£¬ÈÎºÎÈË»ò×éÖ¯²»µÃ½«Æä¾ÝÎª¼ºÓÐ
  * 
  * ³ÌÐòÃû³Æ£º				0.96´çOLEDÏÔÊ¾ÆÁÇý¶¯³ÌÐò£¨7Õë½ÅSPI½Ó¿Ú£©
  * ³ÌÐò´´½¨Ê±¼ä£º			2023.10.24
  * µ±Ç°³ÌÐò°æ±¾£º			V2.0
  * µ±Ç°°æ±¾·¢²¼Ê±¼ä£º		2024.10.20
  * 
  * ½­Ð­¿Æ¼¼¹Ù·½ÍøÕ¾£º		jiangxiekeji.com
  * ½­Ð­¿Æ¼¼¹Ù·½ÌÔ±¦µê£º	jiangxiekeji.taobao.com
  * ³ÌÐò½éÉÜ¼°¸üÐÂ¶¯Ì¬£º	jiangxiekeji.com/tutorial/oled.html
  * 
  * Èç¹ûÄã·¢ÏÖ³ÌÐòÖÐµÄÂ©¶´»òÕß±ÊÎó£¬¿ÉÍ¨¹ýÓÊ¼þÏòÎÒÃÇ·´À¡£ºfeedback@jiangxiekeji.com
  * ·¢ËÍÓÊ¼þÖ®Ç°£¬Äã¿ÉÒÔÏÈµ½¸üÐÂ¶¯Ì¬Ò³Ãæ²é¿´×îÐÂ³ÌÐò£¬Èç¹û´ËÎÊÌâÒÑ¾­ÐÞ¸Ä£¬ÔòÎÞÐèÔÙ·¢ÓÊ¼þ
  ***************************************************************************************
  */

#include "stm32f10x.h"
#include "OLED.h"
#include <string.h>
#include <math.h>
#include <stdio.h>
#include <stdarg.h>

/**
  * Êý¾Ý´æ´¢¸ñÊ½£º
  * ×ÝÏò8µã£¬¸ßÎ»ÔÚÏÂ£¬ÏÈ´Ó×óµ½ÓÒ£¬ÔÙ´ÓÉÏµ½ÏÂ
  * Ã¿Ò»¸öBit¶ÔÓ¦Ò»¸öÏñËØµã
  * 
  *      B0 B0                  B0 B0
  *      B1 B1                  B1 B1
  *      B2 B2                  B2 B2
  *      B3 B3  ------------->  B3 B3 --
  *      B4 B4                  B4 B4  |
  *      B5 B5                  B5 B5  |
  *      B6 B6                  B6 B6  |
  *      B7 B7                  B7 B7  |
  *                                    |
  *  -----------------------------------
  *  |   
  *  |   B0 B0                  B0 B0
  *  |   B1 B1                  B1 B1
  *  |   B2 B2                  B2 B2
  *  --> B3 B3  ------------->  B3 B3
  *      B4 B4                  B4 B4
  *      B5 B5                  B5 B5
  *      B6 B6                  B6 B6
  *      B7 B7                  B7 B7
  * 
  * ×ø±êÖá¶¨Òå£º
  * ×óÉÏ½ÇÎª(0, 0)µã
  * ºáÏòÏòÓÒÎªXÖá£¬È¡Öµ·¶Î§£º0~127
  * ×ÝÏòÏòÏÂÎªYÖá£¬È¡Öµ·¶Î§£º0~63
  * 
  *       0             XÖá           127 
  *      .------------------------------->
  *    0 |
  *      |
  *      |
  *      |
  *  YÖá |
  *      |
  *      |
  *      |
  *   63 |
  *      v
  * 
  */


/*È«¾Ö±äÁ¿*********************/

/**
  * OLEDÏÔ´æÊý×é
  * ËùÓÐµÄÏÔÊ¾º¯Êý£¬¶¼Ö»ÊÇ¶Ô´ËÏÔ´æÊý×é½øÐÐ¶ÁÐ´
  * Ëæºóµ÷ÓÃOLED_Updateº¯Êý»òOLED_UpdateAreaº¯Êý
  * ²Å»á½«ÏÔ´æÊý×éµÄÊý¾Ý·¢ËÍµ½OLEDÓ²¼þ£¬½øÐÐÏÔÊ¾
  */
uint8_t OLED_DisplayBuf[8][128];

/*********************È«¾Ö±äÁ¿*/


/*Òý½ÅÅäÖÃ*********************/

/**
  * º¯    Êý£ºOLEDÐ´D0£¨CLK£©¸ßµÍµçÆ½
  * ²Î    Êý£ºÒªÐ´ÈëD0µÄµçÆ½Öµ£¬·¶Î§£º0/1
  * ·µ »Ø Öµ£ºÎÞ
  * Ëµ    Ã÷£ºµ±ÉÏ²ãº¯ÊýÐèÒªÐ´D0Ê±£¬´Ëº¯Êý»á±»µ÷ÓÃ
  *           ÓÃ»§ÐèÒª¸ù¾Ý²ÎÊý´«ÈëµÄÖµ£¬½«D0ÖÃÎª¸ßµçÆ½»òÕßµÍµçÆ½
  *           µ±²ÎÊý´«Èë0Ê±£¬ÖÃD0ÎªµÍµçÆ½£¬µ±²ÎÊý´«Èë1Ê±£¬ÖÃD0Îª¸ßµçÆ½
  */
void OLED_W_D0(uint8_t BitValue)
{
	/*¸ù¾ÝBitValueµÄÖµ£¬½«D0ÖÃ¸ßµçÆ½»òÕßµÍµçÆ½*/
	GPIO_WriteBit(GPIOB, GPIO_Pin_12, (BitAction)BitValue);
}

/**
  * º¯    Êý£ºOLEDÐ´D1£¨MOSI£©¸ßµÍµçÆ½
  * ²Î    Êý£ºÒªÐ´ÈëD1µÄµçÆ½Öµ£¬·¶Î§£º0/1
  * ·µ »Ø Öµ£ºÎÞ
  * Ëµ    Ã÷£ºµ±ÉÏ²ãº¯ÊýÐèÒªÐ´D1Ê±£¬´Ëº¯Êý»á±»µ÷ÓÃ
  *           ÓÃ»§ÐèÒª¸ù¾Ý²ÎÊý´«ÈëµÄÖµ£¬½«D1ÖÃÎª¸ßµçÆ½»òÕßµÍµçÆ½
  *           µ±²ÎÊý´«Èë0Ê±£¬ÖÃD1ÎªµÍµçÆ½£¬µ±²ÎÊý´«Èë1Ê±£¬ÖÃD1Îª¸ßµçÆ½
  */
void OLED_W_D1(uint8_t BitValue)
{
	/*¸ù¾ÝBitValueµÄÖµ£¬½«D1ÖÃ¸ßµçÆ½»òÕßµÍµçÆ½*/
	GPIO_WriteBit(GPIOB, GPIO_Pin_13, (BitAction)BitValue);
}

/**
  * º¯    Êý£ºOLEDÐ´RES¸ßµÍµçÆ½
  * ²Î    Êý£ºÒªÐ´ÈëRESµÄµçÆ½Öµ£¬·¶Î§£º0/1
  * ·µ »Ø Öµ£ºÎÞ
  * Ëµ    Ã÷£ºµ±ÉÏ²ãº¯ÊýÐèÒªÐ´RESÊ±£¬´Ëº¯Êý»á±»µ÷ÓÃ
  *           ÓÃ»§ÐèÒª¸ù¾Ý²ÎÊý´«ÈëµÄÖµ£¬½«RESÖÃÎª¸ßµçÆ½»òÕßµÍµçÆ½
  *           µ±²ÎÊý´«Èë0Ê±£¬ÖÃRESÎªµÍµçÆ½£¬µ±²ÎÊý´«Èë1Ê±£¬ÖÃRESÎª¸ßµçÆ½
  */
void OLED_W_RES(uint8_t BitValue)
{
	/*¸ù¾ÝBitValueµÄÖµ£¬½«RESÖÃ¸ßµçÆ½»òÕßµÍµçÆ½*/
	GPIO_WriteBit(GPIOB, GPIO_Pin_14, (BitAction)BitValue);
}

/**
  * º¯    Êý£ºOLEDÐ´DC¸ßµÍµçÆ½
  * ²Î    Êý£ºÒªÐ´ÈëDCµÄµçÆ½Öµ£¬·¶Î§£º0/1
  * ·µ »Ø Öµ£ºÎÞ
  * Ëµ    Ã÷£ºµ±ÉÏ²ãº¯ÊýÐèÒªÐ´DCÊ±£¬´Ëº¯Êý»á±»µ÷ÓÃ
  *           ÓÃ»§ÐèÒª¸ù¾Ý²ÎÊý´«ÈëµÄÖµ£¬½«DCÖÃÎª¸ßµçÆ½»òÕßµÍµçÆ½
  *           µ±²ÎÊý´«Èë0Ê±£¬ÖÃDCÎªµÍµçÆ½£¬µ±²ÎÊý´«Èë1Ê±£¬ÖÃDCÎª¸ßµçÆ½
  */
void OLED_W_DC(uint8_t BitValue)
{
	/*¸ù¾ÝBitValueµÄÖµ£¬½«DCÖÃ¸ßµçÆ½»òÕßµÍµçÆ½*/
	GPIO_WriteBit(GPIOB, GPIO_Pin_15, (BitAction)BitValue);
}

/**
  * º¯    Êý£ºOLEDÐ´CS¸ßµÍµçÆ½
  * ²Î    Êý£ºÒªÐ´ÈëCSµÄµçÆ½Öµ£¬·¶Î§£º0/1
  * ·µ »Ø Öµ£ºÎÞ
  * Ëµ    Ã÷£ºµ±ÉÏ²ãº¯ÊýÐèÒªÐ´CSÊ±£¬´Ëº¯Êý»á±»µ÷ÓÃ
  *           ÓÃ»§ÐèÒª¸ù¾Ý²ÎÊý´«ÈëµÄÖµ£¬½«CSÖÃÎª¸ßµçÆ½»òÕßµÍµçÆ½
  *           µ±²ÎÊý´«Èë0Ê±£¬ÖÃCSÎªµÍµçÆ½£¬µ±²ÎÊý´«Èë1Ê±£¬ÖÃCSÎª¸ßµçÆ½
  */
void OLED_W_CS(uint8_t BitValue)
{
	/*¸ù¾ÝBitValueµÄÖµ£¬½«CSÖÃ¸ßµçÆ½»òÕßµÍµçÆ½*/
	GPIO_WriteBit(GPIOA, GPIO_Pin_8, (BitAction)BitValue);
}

/**
  * º¯    Êý£ºOLEDÒý½Å³õÊ¼»¯
  * ²Î    Êý£ºÎÞ
  * ·µ »Ø Öµ£ºÎÞ
  * Ëµ    Ã÷£ºµ±ÉÏ²ãº¯ÊýÐèÒª³õÊ¼»¯Ê±£¬´Ëº¯Êý»á±»µ÷ÓÃ
  *           ÓÃ»§ÐèÒª½«D0¡¢D1¡¢RES¡¢DCºÍCSÒý½Å³õÊ¼»¯ÎªÍÆÍìÊä³öÄ£Ê½
  */
void OLED_GPIO_Init(void)
{
	uint32_t i, j;
	
	/*ÔÚ³õÊ¼»¯Ç°£¬¼ÓÈëÊÊÁ¿ÑÓÊ±£¬´ýOLED¹©µçÎÈ¶¨*/
	for (i = 0; i < 1000; i ++)
	{
		for (j = 0; j < 1000; j ++);
	}
	
	/*½«D0¡¢D1¡¢RES¡¢DCºÍCSÒý½Å³õÊ¼»¯ÎªÍÆÍìÊä³öÄ£Ê½*/
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);
	
	GPIO_InitTypeDef GPIO_InitStructure;
 	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_12;
 	GPIO_Init(GPIOB, &GPIO_InitStructure);
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_13;
 	GPIO_Init(GPIOB, &GPIO_InitStructure);
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_14;
 	GPIO_Init(GPIOB, &GPIO_InitStructure);
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_15;
 	GPIO_Init(GPIOB, &GPIO_InitStructure);
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_8;
 	GPIO_Init(GPIOA, &GPIO_InitStructure);
	
	/*ÖÃÒý½ÅÄ¬ÈÏµçÆ½*/
	OLED_W_D0(0);
	OLED_W_D1(1);
	OLED_W_RES(1);
	OLED_W_DC(1);
	OLED_W_CS(1);
}

/*********************Òý½ÅÅäÖÃ*/


/*Í¨ÐÅÐ­Òé*********************/

/**
  * º¯    Êý£ºSPI·¢ËÍÒ»¸ö×Ö½Ú
  * ²Î    Êý£ºByte Òª·¢ËÍµÄÒ»¸ö×Ö½ÚÊý¾Ý£¬·¶Î§£º0x00~0xFF
  * ·µ »Ø Öµ£ºÎÞ
  */
void OLED_SPI_SendByte(uint8_t Byte)
{
	uint8_t i;
	
	/*Ñ­»·8´Î£¬Ö÷»úÒÀ´Î·¢ËÍÊý¾ÝµÄÃ¿Ò»Î»*/
	for (i = 0; i < 8; i++)
	{
		/*Ê¹ÓÃÑÚÂëµÄ·½Ê½È¡³öByteµÄÖ¸¶¨Ò»Î»Êý¾Ý²¢Ð´Èëµ½D1Ïß*/
		/*Á½¸ö!µÄ×÷ÓÃÊÇ£¬ÈÃËùÓÐ·ÇÁãµÄÖµ±äÎª1*/
		OLED_W_D1(!!(Byte & (0x80 >> i)));
		OLED_W_D0(1);	//À­¸ßD0£¬´Ó»úÔÚD0ÉÏÉýÑØ¶ÁÈ¡SDA
		OLED_W_D0(0);	//À­µÍD0£¬Ö÷»ú¿ªÊ¼·¢ËÍÏÂÒ»Î»Êý¾Ý
	}
}

/**
  * º¯    Êý£ºOLEDÐ´ÃüÁî
  * ²Î    Êý£ºCommand ÒªÐ´ÈëµÄÃüÁîÖµ£¬·¶Î§£º0x00~0xFF
  * ·µ »Ø Öµ£ºÎÞ
  */
void OLED_WriteCommand(uint8_t Command)
{
	OLED_W_CS(0);					//À­µÍCS£¬¿ªÊ¼Í¨ÐÅ
	OLED_W_DC(0);					//À­µÍDC£¬±íÊ¾¼´½«·¢ËÍÃüÁî
	OLED_SPI_SendByte(Command);		//Ð´ÈëÖ¸¶¨ÃüÁî
	OLED_W_CS(1);					//À­¸ßCS£¬½áÊøÍ¨ÐÅ
}

/**
  * º¯    Êý£ºOLEDÐ´Êý¾Ý
  * ²Î    Êý£ºData ÒªÐ´ÈëÊý¾ÝµÄÆðÊ¼µØÖ·
  * ²Î    Êý£ºCount ÒªÐ´ÈëÊý¾ÝµÄÊýÁ¿
  * ·µ »Ø Öµ£ºÎÞ
  */
void OLED_WriteData(uint8_t *Data, uint8_t Count)
{
	uint8_t i;
	
	OLED_W_CS(0);					//À­µÍCS£¬¿ªÊ¼Í¨ÐÅ
	OLED_W_DC(1);					//À­¸ßDC£¬±íÊ¾¼´½«·¢ËÍÊý¾Ý
	/*Ñ­»·Count´Î£¬½øÐÐÁ¬ÐøµÄÊý¾ÝÐ´Èë*/
	for (i = 0; i < Count; i ++)
	{
		OLED_SPI_SendByte(Data[i]);	//ÒÀ´Î·¢ËÍDataµÄÃ¿Ò»¸öÊý¾Ý
	}
	OLED_W_CS(1);					//À­¸ßCS£¬½áÊøÍ¨ÐÅ
}

/*********************Í¨ÐÅÐ­Òé*/


/*Ó²¼þÅäÖÃ*********************/

/**
  * º¯    Êý£ºOLED³õÊ¼»¯
  * ²Î    Êý£ºÎÞ
  * ·µ »Ø Öµ£ºÎÞ
  * Ëµ    Ã÷£ºÊ¹ÓÃÇ°£¬ÐèÒªµ÷ÓÃ´Ë³õÊ¼»¯º¯Êý
  */
void OLED_Init(void)
{
	OLED_GPIO_Init();			//ÏÈµ÷ÓÃµ×²ãµÄ¶Ë¿Ú³õÊ¼»¯
	
	/*Ð´ÈëÒ»ÏµÁÐµÄÃüÁî£¬¶ÔOLED½øÐÐ³õÊ¼»¯ÅäÖÃ*/
	OLED_WriteCommand(0xAE);	//ÉèÖÃÏÔÊ¾¿ªÆô/¹Ø±Õ£¬0xAE¹Ø±Õ£¬0xAF¿ªÆô
	
	OLED_WriteCommand(0xD5);	//ÉèÖÃÏÔÊ¾Ê±ÖÓ·ÖÆµ±È/Õñµ´Æ÷ÆµÂÊ
	OLED_WriteCommand(0x80);	//0x00~0xFF
	
	OLED_WriteCommand(0xA8);	//ÉèÖÃ¶àÂ·¸´ÓÃÂÊ
	OLED_WriteCommand(0x3F);	//0x0E~0x3F
	
	OLED_WriteCommand(0xD3);	//ÉèÖÃÏÔÊ¾Æ«ÒÆ
	OLED_WriteCommand(0x00);	//0x00~0x7F
	
	OLED_WriteCommand(0x40);	//ÉèÖÃÏÔÊ¾¿ªÊ¼ÐÐ£¬0x40~0x7F
	
	OLED_WriteCommand(0xA1);	//ÉèÖÃ×óÓÒ·½Ïò£¬0xA1Õý³££¬0xA0×óÓÒ·´ÖÃ
	
	OLED_WriteCommand(0xC8);	//ÉèÖÃÉÏÏÂ·½Ïò£¬0xC8Õý³££¬0xC0ÉÏÏÂ·´ÖÃ

	OLED_WriteCommand(0xDA);	//ÉèÖÃCOMÒý½ÅÓ²¼þÅäÖÃ
	OLED_WriteCommand(0x12);
	
	OLED_WriteCommand(0x81);	//ÉèÖÃ¶Ô±È¶È
	OLED_WriteCommand(0xCF);	//0x00~0xFF

	OLED_WriteCommand(0xD9);	//ÉèÖÃÔ¤³äµçÖÜÆÚ
	OLED_WriteCommand(0xF1);

	OLED_WriteCommand(0xDB);	//ÉèÖÃVCOMHÈ¡ÏûÑ¡Ôñ¼¶±ð
	OLED_WriteCommand(0x30);

	OLED_WriteCommand(0xA4);	//ÉèÖÃÕû¸öÏÔÊ¾´ò¿ª/¹Ø±Õ

	OLED_WriteCommand(0xA6);	//ÉèÖÃÕý³£/·´É«ÏÔÊ¾£¬0xA6Õý³££¬0xA7·´É«

	OLED_WriteCommand(0x8D);	//ÉèÖÃ³äµç±Ã
	OLED_WriteCommand(0x14);

	OLED_WriteCommand(0xAF);	//¿ªÆôÏÔÊ¾
	
	OLED_Clear();				//Çå¿ÕÏÔ´æÊý×é
	OLED_Update();				//¸üÐÂÏÔÊ¾£¬ÇåÆÁ£¬·ÀÖ¹³õÊ¼»¯ºóÎ´ÏÔÊ¾ÄÚÈÝÊ±»¨ÆÁ
}

/**
  * º¯    Êý£ºOLEDÉèÖÃÏÔÊ¾¹â±êÎ»ÖÃ
  * ²Î    Êý£ºPage Ö¸¶¨¹â±êËùÔÚµÄÒ³£¬·¶Î§£º0~7
  * ²Î    Êý£ºX Ö¸¶¨¹â±êËùÔÚµÄXÖá×ø±ê£¬·¶Î§£º0~127
  * ·µ »Ø Öµ£ºÎÞ
  * Ëµ    Ã÷£ºOLEDÄ¬ÈÏµÄYÖá£¬Ö»ÄÜ8¸öBitÎªÒ»×éÐ´Èë£¬¼´1Ò³µÈÓÚ8¸öYÖá×ø±ê
  */
void OLED_SetCursor(uint8_t Page, uint8_t X)
{
	/*Èç¹ûÊ¹ÓÃ´Ë³ÌÐòÇý¶¯1.3´çµÄOLEDÏÔÊ¾ÆÁ£¬ÔòÐèÒª½â³ý´Ë×¢ÊÍ*/
	/*ÒòÎª1.3´çµÄOLEDÇý¶¯Ð¾Æ¬£¨SH1106£©ÓÐ132ÁÐ*/
	/*ÆÁÄ»µÄÆðÊ¼ÁÐ½ÓÔÚÁËµÚ2ÁÐ£¬¶ø²»ÊÇµÚ0ÁÐ*/
	/*ËùÒÔÐèÒª½«X¼Ó2£¬²ÅÄÜÕý³£ÏÔÊ¾*/
//	X += 2;
	
	/*Í¨¹ýÖ¸ÁîÉèÖÃÒ³µØÖ·ºÍÁÐµØÖ·*/
	OLED_WriteCommand(0xB0 | Page);					//ÉèÖÃÒ³Î»ÖÃ
	OLED_WriteCommand(0x10 | ((X & 0xF0) >> 4));	//ÉèÖÃXÎ»ÖÃ¸ß4Î»
	OLED_WriteCommand(0x00 | (X & 0x0F));			//ÉèÖÃXÎ»ÖÃµÍ4Î»
}

/*********************Ó²¼þÅäÖÃ*/


/*¹¤¾ßº¯Êý*********************/

/*¹¤¾ßº¯Êý½ö¹©ÄÚ²¿²¿·Öº¯ÊýÊ¹ÓÃ*/

/**
  * º¯    Êý£º´Î·½º¯Êý
  * ²Î    Êý£ºX µ×Êý
  * ²Î    Êý£ºY Ö¸Êý
  * ·µ »Ø Öµ£ºµÈÓÚXµÄY´Î·½
  */
uint32_t OLED_Pow(uint32_t X, uint32_t Y)
{
	uint32_t Result = 1;	//½á¹ûÄ¬ÈÏÎª1
	while (Y --)			//ÀÛ³ËY´Î
	{
		Result *= X;		//Ã¿´Î°ÑXÀÛ³Ëµ½½á¹ûÉÏ
	}
	return Result;
}

/**
  * º¯    Êý£ºÅÐ¶ÏÖ¸¶¨µãÊÇ·ñÔÚÖ¸¶¨¶à±ßÐÎÄÚ²¿
  * ²Î    Êý£ºnvert ¶à±ßÐÎµÄ¶¥µãÊý
  * ²Î    Êý£ºvertx verty °üº¬¶à±ßÐÎ¶¥µãµÄxºÍy×ø±êµÄÊý×é
  * ²Î    Êý£ºtestx testy ²âÊÔµãµÄXºÍy×ø±ê
  * ·µ »Ø Öµ£ºÖ¸¶¨µãÊÇ·ñÔÚÖ¸¶¨¶à±ßÐÎÄÚ²¿£¬1£ºÔÚÄÚ²¿£¬0£º²»ÔÚÄÚ²¿
  */
uint8_t OLED_pnpoly(uint8_t nvert, int16_t *vertx, int16_t *verty, int16_t testx, int16_t testy)
{
	int16_t i, j, c = 0;
	
	/*´ËËã·¨ÓÉW. Randolph FranklinÌá³ö*/
	/*²Î¿¼Á´½Ó£ºhttps://wrfranklin.org/Research/Short_Notes/pnpoly.html*/
	for (i = 0, j = nvert - 1; i < nvert; j = i++)
	{
		if (((verty[i] > testy) != (verty[j] > testy)) &&
			(testx < (vertx[j] - vertx[i]) * (testy - verty[i]) / (verty[j] - verty[i]) + vertx[i]))
		{
			c = !c;
		}
	}
	return c;
}

/**
  * º¯    Êý£ºÅÐ¶ÏÖ¸¶¨µãÊÇ·ñÔÚÖ¸¶¨½Ç¶ÈÄÚ²¿
  * ²Î    Êý£ºX Y Ö¸¶¨µãµÄ×ø±ê
  * ²Î    Êý£ºStartAngle EndAngle ÆðÊ¼½Ç¶ÈºÍÖÕÖ¹½Ç¶È£¬·¶Î§£º-180~180
  *           Ë®Æ½ÏòÓÒÎª0¶È£¬Ë®Æ½Ïò×óÎª180¶È»ò-180¶È£¬ÏÂ·½ÎªÕýÊý£¬ÉÏ·½Îª¸ºÊý£¬Ë³Ê±ÕëÐý×ª
  * ·µ »Ø Öµ£ºÖ¸¶¨µãÊÇ·ñÔÚÖ¸¶¨½Ç¶ÈÄÚ²¿£¬1£ºÔÚÄÚ²¿£¬0£º²»ÔÚÄÚ²¿
  */
uint8_t OLED_IsInAngle(int16_t X, int16_t Y, int16_t StartAngle, int16_t EndAngle)
{
	int16_t PointAngle;
	PointAngle = atan2(Y, X) / 3.14 * 180;	//¼ÆËãÖ¸¶¨µãµÄ»¡¶È£¬²¢×ª»»Îª½Ç¶È±íÊ¾
	if (StartAngle < EndAngle)	//ÆðÊ¼½Ç¶ÈÐ¡ÓÚÖÕÖ¹½Ç¶ÈµÄÇé¿ö
	{
		/*Èç¹ûÖ¸¶¨½Ç¶ÈÔÚÆðÊ¼ÖÕÖ¹½Ç¶ÈÖ®¼ä£¬ÔòÅÐ¶¨Ö¸¶¨µãÔÚÖ¸¶¨½Ç¶È*/
		if (PointAngle >= StartAngle && PointAngle <= EndAngle)
		{
			return 1;
		}
	}
	else			//ÆðÊ¼½Ç¶È´óÓÚÓÚÖÕÖ¹½Ç¶ÈµÄÇé¿ö
	{
		/*Èç¹ûÖ¸¶¨½Ç¶È´óÓÚÆðÊ¼½Ç¶È»òÕßÐ¡ÓÚÖÕÖ¹½Ç¶È£¬ÔòÅÐ¶¨Ö¸¶¨µãÔÚÖ¸¶¨½Ç¶È*/
		if (PointAngle >= StartAngle || PointAngle <= EndAngle)
		{
			return 1;
		}
	}
	return 0;		//²»Âú×ãÒÔÉÏÌõ¼þ£¬ÔòÅÐ¶ÏÅÐ¶¨Ö¸¶¨µã²»ÔÚÖ¸¶¨½Ç¶È
}

/*********************¹¤¾ßº¯Êý*/


/*¹¦ÄÜº¯Êý*********************/

/**
  * º¯    Êý£º½«OLEDÏÔ´æÊý×é¸üÐÂµ½OLEDÆÁÄ»
  * ²Î    Êý£ºÎÞ
  * ·µ »Ø Öµ£ºÎÞ
  * Ëµ    Ã÷£ºËùÓÐµÄÏÔÊ¾º¯Êý£¬¶¼Ö»ÊÇ¶ÔOLEDÏÔ´æÊý×é½øÐÐ¶ÁÐ´
  *           Ëæºóµ÷ÓÃOLED_Updateº¯Êý»òOLED_UpdateAreaº¯Êý
  *           ²Å»á½«ÏÔ´æÊý×éµÄÊý¾Ý·¢ËÍµ½OLEDÓ²¼þ£¬½øÐÐÏÔÊ¾
  *           ¹Êµ÷ÓÃÏÔÊ¾º¯Êýºó£¬ÒªÏëÕæÕýµØ³ÊÏÖÔÚÆÁÄ»ÉÏ£¬»¹Ðèµ÷ÓÃ¸üÐÂº¯Êý
  */
void OLED_Update(void)
{
	uint8_t j;
	/*±éÀúÃ¿Ò»Ò³*/
	for (j = 0; j < 8; j ++)
	{
		/*ÉèÖÃ¹â±êÎ»ÖÃÎªÃ¿Ò»Ò³µÄµÚÒ»ÁÐ*/
		OLED_SetCursor(j, 0);
		/*Á¬ÐøÐ´Èë128¸öÊý¾Ý£¬½«ÏÔ´æÊý×éµÄÊý¾ÝÐ´Èëµ½OLEDÓ²¼þ*/
		OLED_WriteData(OLED_DisplayBuf[j], 128);
	}
}

/**
  * º¯    Êý£º½«OLEDÏÔ´æÊý×é²¿·Ö¸üÐÂµ½OLEDÆÁÄ»
  * ²Î    Êý£ºX Ö¸¶¨ÇøÓò×óÉÏ½ÇµÄºá×ø±ê£¬·¶Î§£º-32768~32767£¬ÆÁÄ»ÇøÓò£º0~127
  * ²Î    Êý£ºY Ö¸¶¨ÇøÓò×óÉÏ½ÇµÄ×Ý×ø±ê£¬·¶Î§£º-32768~32767£¬ÆÁÄ»ÇøÓò£º0~63
  * ²Î    Êý£ºWidth Ö¸¶¨ÇøÓòµÄ¿í¶È£¬·¶Î§£º0~128
  * ²Î    Êý£ºHeight Ö¸¶¨ÇøÓòµÄ¸ß¶È£¬·¶Î§£º0~64
  * ·µ »Ø Öµ£ºÎÞ
  * Ëµ    Ã÷£º´Ëº¯Êý»áÖÁÉÙ¸üÐÂ²ÎÊýÖ¸¶¨µÄÇøÓò
  *           Èç¹û¸üÐÂÇøÓòYÖáÖ»°üº¬²¿·ÖÒ³£¬ÔòÍ¬Ò»Ò³µÄÊ£Óà²¿·Ö»á¸úËæÒ»Æð¸üÐÂ
  * Ëµ    Ã÷£ºËùÓÐµÄÏÔÊ¾º¯Êý£¬¶¼Ö»ÊÇ¶ÔOLEDÏÔ´æÊý×é½øÐÐ¶ÁÐ´
  *           Ëæºóµ÷ÓÃOLED_Updateº¯Êý»òOLED_UpdateAreaº¯Êý
  *           ²Å»á½«ÏÔ´æÊý×éµÄÊý¾Ý·¢ËÍµ½OLEDÓ²¼þ£¬½øÐÐÏÔÊ¾
  *           ¹Êµ÷ÓÃÏÔÊ¾º¯Êýºó£¬ÒªÏëÕæÕýµØ³ÊÏÖÔÚÆÁÄ»ÉÏ£¬»¹Ðèµ÷ÓÃ¸üÐÂº¯Êý
  */
void OLED_UpdateArea(int16_t X, int16_t Y, uint8_t Width, uint8_t Height)
{
	int16_t j;
	int16_t Page, Page1;
	
	/*¸ºÊý×ø±êÔÚ¼ÆËãÒ³µØÖ·Ê±ÐèÒª¼ÓÒ»¸öÆ«ÒÆ*/
	/*(Y + Height - 1) / 8 + 1µÄÄ¿µÄÊÇ(Y + Height) / 8²¢ÏòÉÏÈ¡Õû*/
	Page = Y / 8;
	Page1 = (Y + Height - 1) / 8 + 1;
	if (Y < 0)
	{
		Page -= 1;
		Page1 -= 1;
	}
	
	/*±éÀúÖ¸¶¨ÇøÓòÉæ¼°µÄÏà¹ØÒ³*/
	for (j = Page; j < Page1; j ++)
	{
		if (X >= 0 && X <= 127 && j >= 0 && j <= 7)		//³¬³öÆÁÄ»µÄÄÚÈÝ²»ÏÔÊ¾
		{
			/*ÉèÖÃ¹â±êÎ»ÖÃÎªÏà¹ØÒ³µÄÖ¸¶¨ÁÐ*/
			OLED_SetCursor(j, X);
			/*Á¬ÐøÐ´ÈëWidth¸öÊý¾Ý£¬½«ÏÔ´æÊý×éµÄÊý¾ÝÐ´Èëµ½OLEDÓ²¼þ*/
			OLED_WriteData(&OLED_DisplayBuf[j][X], Width);
		}
	}
}

/**
  * º¯    Êý£º½«OLEDÏÔ´æÊý×éÈ«²¿ÇåÁã
  * ²Î    Êý£ºÎÞ
  * ·µ »Ø Öµ£ºÎÞ
  * Ëµ    Ã÷£ºµ÷ÓÃ´Ëº¯Êýºó£¬ÒªÏëÕæÕýµØ³ÊÏÖÔÚÆÁÄ»ÉÏ£¬»¹Ðèµ÷ÓÃ¸üÐÂº¯Êý
  */
void OLED_Clear(void)
{
	uint8_t i, j;
	for (j = 0; j < 8; j ++)				//±éÀú8Ò³
	{
		for (i = 0; i < 128; i ++)			//±éÀú128ÁÐ
		{
			OLED_DisplayBuf[j][i] = 0x00;	//½«ÏÔ´æÊý×éÊý¾ÝÈ«²¿ÇåÁã
		}
	}
}

/**
  * º¯    Êý£º½«OLEDÏÔ´æÊý×é²¿·ÖÇåÁã
  * ²Î    Êý£ºX Ö¸¶¨ÇøÓò×óÉÏ½ÇµÄºá×ø±ê£¬·¶Î§£º-32768~32767£¬ÆÁÄ»ÇøÓò£º0~127
  * ²Î    Êý£ºY Ö¸¶¨ÇøÓò×óÉÏ½ÇµÄ×Ý×ø±ê£¬·¶Î§£º-32768~32767£¬ÆÁÄ»ÇøÓò£º0~63
  * ²Î    Êý£ºWidth Ö¸¶¨ÇøÓòµÄ¿í¶È£¬·¶Î§£º0~128
  * ²Î    Êý£ºHeight Ö¸¶¨ÇøÓòµÄ¸ß¶È£¬·¶Î§£º0~64
  * ·µ »Ø Öµ£ºÎÞ
  * Ëµ    Ã÷£ºµ÷ÓÃ´Ëº¯Êýºó£¬ÒªÏëÕæÕýµØ³ÊÏÖÔÚÆÁÄ»ÉÏ£¬»¹Ðèµ÷ÓÃ¸üÐÂº¯Êý
  */
void OLED_ClearArea(int16_t X, int16_t Y, uint8_t Width, uint8_t Height)
{
	int16_t i, j;
	
	for (j = Y; j < Y + Height; j ++)		//±éÀúÖ¸¶¨Ò³
	{
		for (i = X; i < X + Width; i ++)	//±éÀúÖ¸¶¨ÁÐ
		{
			if (i >= 0 && i <= 127 && j >=0 && j <= 63)				//³¬³öÆÁÄ»µÄÄÚÈÝ²»ÏÔÊ¾
			{
				OLED_DisplayBuf[j / 8][i] &= ~(0x01 << (j % 8));	//½«ÏÔ´æÊý×éÖ¸¶¨Êý¾ÝÇåÁã
			}
		}
	}
}

/**
  * º¯    Êý£º½«OLEDÏÔ´æÊý×éÈ«²¿È¡·´
  * ²Î    Êý£ºÎÞ
  * ·µ »Ø Öµ£ºÎÞ
  * Ëµ    Ã÷£ºµ÷ÓÃ´Ëº¯Êýºó£¬ÒªÏëÕæÕýµØ³ÊÏÖÔÚÆÁÄ»ÉÏ£¬»¹Ðèµ÷ÓÃ¸üÐÂº¯Êý
  */
void OLED_Reverse(void)
{
	uint8_t i, j;
	for (j = 0; j < 8; j ++)				//±éÀú8Ò³
	{
		for (i = 0; i < 128; i ++)			//±éÀú128ÁÐ
		{
			OLED_DisplayBuf[j][i] ^= 0xFF;	//½«ÏÔ´æÊý×éÊý¾ÝÈ«²¿È¡·´
		}
	}
}
	
/**
  * º¯    Êý£º½«OLEDÏÔ´æÊý×é²¿·ÖÈ¡·´
  * ²Î    Êý£ºX Ö¸¶¨ÇøÓò×óÉÏ½ÇµÄºá×ø±ê£¬·¶Î§£º-32768~32767£¬ÆÁÄ»ÇøÓò£º0~127
  * ²Î    Êý£ºY Ö¸¶¨ÇøÓò×óÉÏ½ÇµÄ×Ý×ø±ê£¬·¶Î§£º-32768~32767£¬ÆÁÄ»ÇøÓò£º0~63
  * ²Î    Êý£ºWidth Ö¸¶¨ÇøÓòµÄ¿í¶È£¬·¶Î§£º0~128
  * ²Î    Êý£ºHeight Ö¸¶¨ÇøÓòµÄ¸ß¶È£¬·¶Î§£º0~64
  * ·µ »Ø Öµ£ºÎÞ
  * Ëµ    Ã÷£ºµ÷ÓÃ´Ëº¯Êýºó£¬ÒªÏëÕæÕýµØ³ÊÏÖÔÚÆÁÄ»ÉÏ£¬»¹Ðèµ÷ÓÃ¸üÐÂº¯Êý
  */
void OLED_ReverseArea(int16_t X, int16_t Y, uint8_t Width, uint8_t Height)
{
	int16_t i, j;
	
	for (j = Y; j < Y + Height; j ++)		//±éÀúÖ¸¶¨Ò³
	{
		for (i = X; i < X + Width; i ++)	//±éÀúÖ¸¶¨ÁÐ
		{
			if (i >= 0 && i <= 127 && j >=0 && j <= 63)			//³¬³öÆÁÄ»µÄÄÚÈÝ²»ÏÔÊ¾
			{
				OLED_DisplayBuf[j / 8][i] ^= 0x01 << (j % 8);	//½«ÏÔ´æÊý×éÖ¸¶¨Êý¾ÝÈ¡·´
			}
		}
	}
}

/**
  * º¯    Êý£ºOLEDÏÔÊ¾Ò»¸ö×Ö·û
  * ²Î    Êý£ºX Ö¸¶¨×Ö·û×óÉÏ½ÇµÄºá×ø±ê£¬·¶Î§£º-32768~32767£¬ÆÁÄ»ÇøÓò£º0~127
  * ²Î    Êý£ºY Ö¸¶¨×Ö·û×óÉÏ½ÇµÄ×Ý×ø±ê£¬·¶Î§£º-32768~32767£¬ÆÁÄ»ÇøÓò£º0~63
  * ²Î    Êý£ºChar Ö¸¶¨ÒªÏÔÊ¾µÄ×Ö·û£¬·¶Î§£ºASCIIÂë¿É¼û×Ö·û
  * ²Î    Êý£ºFontSize Ö¸¶¨×ÖÌå´óÐ¡
  *           ·¶Î§£ºOLED_8X16		¿í8ÏñËØ£¬¸ß16ÏñËØ
  *                 OLED_6X8		¿í6ÏñËØ£¬¸ß8ÏñËØ
  * ·µ »Ø Öµ£ºÎÞ
  * Ëµ    Ã÷£ºµ÷ÓÃ´Ëº¯Êýºó£¬ÒªÏëÕæÕýµØ³ÊÏÖÔÚÆÁÄ»ÉÏ£¬»¹Ðèµ÷ÓÃ¸üÐÂº¯Êý
  */
void OLED_ShowChar(int16_t X, int16_t Y, char Char, uint8_t FontSize)
{
	if (FontSize == OLED_8X16)		//×ÖÌåÎª¿í8ÏñËØ£¬¸ß16ÏñËØ
	{
		/*½«ASCII×ÖÄ£¿âOLED_F8x16µÄÖ¸¶¨Êý¾ÝÒÔ8*16µÄÍ¼Ïñ¸ñÊ½ÏÔÊ¾*/
		OLED_ShowImage(X, Y, 8, 16, OLED_F8x16[Char - ' ']);
	}
	else if(FontSize == OLED_6X8)	//×ÖÌåÎª¿í6ÏñËØ£¬¸ß8ÏñËØ
	{
		/*½«ASCII×ÖÄ£¿âOLED_F6x8µÄÖ¸¶¨Êý¾ÝÒÔ6*8µÄÍ¼Ïñ¸ñÊ½ÏÔÊ¾*/
		OLED_ShowImage(X, Y, 6, 8, OLED_F6x8[Char - ' ']);
	}
}

/**
  * º¯    Êý£ºOLEDÏÔÊ¾×Ö·û´®£¨Ö§³ÖASCIIÂëºÍÖÐÎÄ»ìºÏÐ´Èë£©
  * ²Î    Êý£ºX Ö¸¶¨×Ö·û´®×óÉÏ½ÇµÄºá×ø±ê£¬·¶Î§£º-32768~32767£¬ÆÁÄ»ÇøÓò£º0~127
  * ²Î    Êý£ºY Ö¸¶¨×Ö·û´®×óÉÏ½ÇµÄ×Ý×ø±ê£¬·¶Î§£º-32768~32767£¬ÆÁÄ»ÇøÓò£º0~63
  * ²Î    Êý£ºString Ö¸¶¨ÒªÏÔÊ¾µÄ×Ö·û´®£¬·¶Î§£ºASCIIÂë¿É¼û×Ö·û»òÖÐÎÄ×Ö·û×é³ÉµÄ×Ö·û´®
  * ²Î    Êý£ºFontSize Ö¸¶¨×ÖÌå´óÐ¡
  *           ·¶Î§£ºOLED_8X16		¿í8ÏñËØ£¬¸ß16ÏñËØ
  *                 OLED_6X8		¿í6ÏñËØ£¬¸ß8ÏñËØ
  * ·µ »Ø Öµ£ºÎÞ
  * Ëµ    Ã÷£ºÏÔÊ¾µÄÖÐÎÄ×Ö·ûÐèÒªÔÚOLED_Data.cÀïµÄOLED_CF16x16Êý×é¶¨Òå
  *           Î´ÕÒµ½Ö¸¶¨ÖÐÎÄ×Ö·ûÊ±£¬»áÏÔÊ¾Ä¬ÈÏÍ¼ÐÎ£¨Ò»¸ö·½¿ò£¬ÄÚ²¿Ò»¸öÎÊºÅ£©
  *           µ±×ÖÌå´óÐ¡ÎªOLED_8X16Ê±£¬ÖÐÎÄ×Ö·ûÒÔ16*16µãÕóÕý³£ÏÔÊ¾
  *           µ±×ÖÌå´óÐ¡ÎªOLED_6X8Ê±£¬ÖÐÎÄ×Ö·ûÒÔ6*8µãÕóÏÔÊ¾'?'
  * Ëµ    Ã÷£ºµ÷ÓÃ´Ëº¯Êýºó£¬ÒªÏëÕæÕýµØ³ÊÏÖÔÚÆÁÄ»ÉÏ£¬»¹Ðèµ÷ÓÃ¸üÐÂº¯Êý
  */
void OLED_ShowString(int16_t X, int16_t Y, char *String, uint8_t FontSize)
{
	uint16_t i = 0;
	char SingleChar[5];
	uint8_t CharLength = 0;
	uint16_t XOffset = 0;
	uint16_t pIndex;
	
	while (String[i] != '\0')	//±éÀú×Ö·û´®
	{
		
#ifdef OLED_CHARSET_UTF8						//¶¨Òå×Ö·û¼¯ÎªUTF8
		/*´Ë¶Î´úÂëµÄÄ¿µÄÊÇ£¬ÌáÈ¡UTF8×Ö·û´®ÖÐµÄÒ»¸ö×Ö·û£¬×ª´æµ½SingleChar×Ó×Ö·û´®ÖÐ*/
		/*ÅÐ¶ÏUTF8±àÂëµÚÒ»¸ö×Ö½ÚµÄ±êÖ¾Î»*/
		if ((String[i] & 0x80) == 0x00)			//µÚÒ»¸ö×Ö½ÚÎª0xxxxxxx
		{
			CharLength = 1;						//×Ö·ûÎª1×Ö½Ú
			SingleChar[0] = String[i ++];		//½«µÚÒ»¸ö×Ö½ÚÐ´ÈëSingleCharµÚ0¸öÎ»ÖÃ£¬ËæºóiÖ¸ÏòÏÂÒ»¸ö×Ö½Ú
			SingleChar[1] = '\0';				//ÎªSingleCharÌí¼Ó×Ö·û´®½áÊø±êÖ¾Î»
		}
		else if ((String[i] & 0xE0) == 0xC0)	//µÚÒ»¸ö×Ö½ÚÎª110xxxxx
		{
			CharLength = 2;						//×Ö·ûÎª2×Ö½Ú
			SingleChar[0] = String[i ++];		//½«µÚÒ»¸ö×Ö½ÚÐ´ÈëSingleCharµÚ0¸öÎ»ÖÃ£¬ËæºóiÖ¸ÏòÏÂÒ»¸ö×Ö½Ú
			if (String[i] == '\0') {break;}		//ÒâÍâÇé¿ö£¬Ìø³öÑ­»·£¬½áÊøÏÔÊ¾
			SingleChar[1] = String[i ++];		//½«µÚ¶þ¸ö×Ö½ÚÐ´ÈëSingleCharµÚ1¸öÎ»ÖÃ£¬ËæºóiÖ¸ÏòÏÂÒ»¸ö×Ö½Ú
			SingleChar[2] = '\0';				//ÎªSingleCharÌí¼Ó×Ö·û´®½áÊø±êÖ¾Î»
		}
		else if ((String[i] & 0xF0) == 0xE0)	//µÚÒ»¸ö×Ö½ÚÎª1110xxxx
		{
			CharLength = 3;						//×Ö·ûÎª3×Ö½Ú
			SingleChar[0] = String[i ++];
			if (String[i] == '\0') {break;}
			SingleChar[1] = String[i ++];
			if (String[i] == '\0') {break;}
			SingleChar[2] = String[i ++];
			SingleChar[3] = '\0';
		}
		else if ((String[i] & 0xF8) == 0xF0)	//µÚÒ»¸ö×Ö½ÚÎª11110xxx
		{
			CharLength = 4;						//×Ö·ûÎª4×Ö½Ú
			SingleChar[0] = String[i ++];
			if (String[i] == '\0') {break;}
			SingleChar[1] = String[i ++];
			if (String[i] == '\0') {break;}
			SingleChar[2] = String[i ++];
			if (String[i] == '\0') {break;}
			SingleChar[3] = String[i ++];
			SingleChar[4] = '\0';
		}
		else
		{
			i ++;			//ÒâÍâÇé¿ö£¬iÖ¸ÏòÏÂÒ»¸ö×Ö½Ú£¬ºöÂÔ´Ë×Ö½Ú£¬¼ÌÐøÅÐ¶ÏÏÂÒ»¸ö×Ö½Ú
			continue;
		}
#endif
		
#ifdef OLED_CHARSET_GB2312						//¶¨Òå×Ö·û¼¯ÎªGB2312
		/*´Ë¶Î´úÂëµÄÄ¿µÄÊÇ£¬ÌáÈ¡GB2312×Ö·û´®ÖÐµÄÒ»¸ö×Ö·û£¬×ª´æµ½SingleChar×Ó×Ö·û´®ÖÐ*/
		/*ÅÐ¶ÏGB2312×Ö½ÚµÄ×î¸ßÎ»±êÖ¾Î»*/
		if ((String[i] & 0x80) == 0x00)			//×î¸ßÎ»Îª0
		{
			CharLength = 1;						//×Ö·ûÎª1×Ö½Ú
			SingleChar[0] = String[i ++];		//½«µÚÒ»¸ö×Ö½ÚÐ´ÈëSingleCharµÚ0¸öÎ»ÖÃ£¬ËæºóiÖ¸ÏòÏÂÒ»¸ö×Ö½Ú
			SingleChar[1] = '\0';				//ÎªSingleCharÌí¼Ó×Ö·û´®½áÊø±êÖ¾Î»
		}
		else									//×î¸ßÎ»Îª1
		{
			CharLength = 2;						//×Ö·ûÎª2×Ö½Ú
			SingleChar[0] = String[i ++];		//½«µÚÒ»¸ö×Ö½ÚÐ´ÈëSingleCharµÚ0¸öÎ»ÖÃ£¬ËæºóiÖ¸ÏòÏÂÒ»¸ö×Ö½Ú
			if (String[i] == '\0') {break;}		//ÒâÍâÇé¿ö£¬Ìø³öÑ­»·£¬½áÊøÏÔÊ¾
			SingleChar[1] = String[i ++];		//½«µÚ¶þ¸ö×Ö½ÚÐ´ÈëSingleCharµÚ1¸öÎ»ÖÃ£¬ËæºóiÖ¸ÏòÏÂÒ»¸ö×Ö½Ú
			SingleChar[2] = '\0';				//ÎªSingleCharÌí¼Ó×Ö·û´®½áÊø±êÖ¾Î»
		}
#endif
		
		/*ÏÔÊ¾ÉÏÊö´úÂëÌáÈ¡µ½µÄSingleChar*/
		if (CharLength == 1)	//Èç¹ûÊÇµ¥×Ö½Ú×Ö·û
		{
			/*Ê¹ÓÃOLED_ShowCharÏÔÊ¾´Ë×Ö·û*/
			OLED_ShowChar(X + XOffset, Y, SingleChar[0], FontSize);
			XOffset += FontSize;
		}
		else					//·ñÔò£¬¼´¶à×Ö½Ú×Ö·û
		{
			/*±éÀúÕû¸ö×ÖÄ£¿â£¬´Ó×ÖÄ£¿âÖÐÑ°ÕÒ´Ë×Ö·ûµÄÊý¾Ý*/
			/*Èç¹ûÕÒµ½×îºóÒ»¸ö×Ö·û£¨¶¨ÒåÎª¿Õ×Ö·û´®£©£¬Ôò±íÊ¾×Ö·ûÎ´ÔÚ×ÖÄ£¿â¶¨Òå£¬Í£Ö¹Ñ°ÕÒ*/
			for (pIndex = 0; strcmp(OLED_CF16x16[pIndex].Index, "") != 0; pIndex ++)
			{
				/*ÕÒµ½Æ¥ÅäµÄ×Ö·û*/
				if (strcmp(OLED_CF16x16[pIndex].Index, SingleChar) == 0)
				{
					break;		//Ìø³öÑ­»·£¬´ËÊ±pIndexµÄÖµÎªÖ¸¶¨×Ö·ûµÄË÷Òý
				}
			}
			if (FontSize == OLED_8X16)		//¸ø¶¨×ÖÌåÎª8*16µãÕó
			{
				/*½«×ÖÄ£¿âOLED_CF16x16µÄÖ¸¶¨Êý¾ÝÒÔ16*16µÄÍ¼Ïñ¸ñÊ½ÏÔÊ¾*/
				OLED_ShowImage(X + XOffset, Y, 16, 16, OLED_CF16x16[pIndex].Data);
				XOffset += 16;
			}
			else if (FontSize == OLED_6X8)	//¸ø¶¨×ÖÌåÎª6*8µãÕó
			{
				/*¿Õ¼ä²»×ã£¬´ËÎ»ÖÃÏÔÊ¾'?'*/
				OLED_ShowChar(X + XOffset, Y, '?', OLED_6X8);
				XOffset += OLED_6X8;
			}
		}
	}
}

/**
  * º¯    Êý£ºOLEDÏÔÊ¾Êý×Ö£¨Ê®½øÖÆ£¬ÕýÕûÊý£©
  * ²Î    Êý£ºX Ö¸¶¨Êý×Ö×óÉÏ½ÇµÄºá×ø±ê£¬·¶Î§£º-32768~32767£¬ÆÁÄ»ÇøÓò£º0~127
  * ²Î    Êý£ºY Ö¸¶¨Êý×Ö×óÉÏ½ÇµÄ×Ý×ø±ê£¬·¶Î§£º-32768~32767£¬ÆÁÄ»ÇøÓò£º0~63
  * ²Î    Êý£ºNumber Ö¸¶¨ÒªÏÔÊ¾µÄÊý×Ö£¬·¶Î§£º0~4294967295
  * ²Î    Êý£ºLength Ö¸¶¨Êý×ÖµÄ³¤¶È£¬·¶Î§£º0~10
  * ²Î    Êý£ºFontSize Ö¸¶¨×ÖÌå´óÐ¡
  *           ·¶Î§£ºOLED_8X16		¿í8ÏñËØ£¬¸ß16ÏñËØ
  *                 OLED_6X8		¿í6ÏñËØ£¬¸ß8ÏñËØ
  * ·µ »Ø Öµ£ºÎÞ
  * Ëµ    Ã÷£ºµ÷ÓÃ´Ëº¯Êýºó£¬ÒªÏëÕæÕýµØ³ÊÏÖÔÚÆÁÄ»ÉÏ£¬»¹Ðèµ÷ÓÃ¸üÐÂº¯Êý
  */
void OLED_ShowNum(int16_t X, int16_t Y, uint32_t Number, uint8_t Length, uint8_t FontSize)
{
	uint8_t i;
	for (i = 0; i < Length; i++)		//±éÀúÊý×ÖµÄÃ¿Ò»Î»							
	{
		/*µ÷ÓÃOLED_ShowCharº¯Êý£¬ÒÀ´ÎÏÔÊ¾Ã¿¸öÊý×Ö*/
		/*Number / OLED_Pow(10, Length - i - 1) % 10 ¿ÉÒÔÊ®½øÖÆÌáÈ¡Êý×ÖµÄÃ¿Ò»Î»*/
		/*+ '0' ¿É½«Êý×Ö×ª»»Îª×Ö·û¸ñÊ½*/
		OLED_ShowChar(X + i * FontSize, Y, Number / OLED_Pow(10, Length - i - 1) % 10 + '0', FontSize);
	}
}

/**
  * º¯    Êý£ºOLEDÏÔÊ¾ÓÐ·ûºÅÊý×Ö£¨Ê®½øÖÆ£¬ÕûÊý£©
  * ²Î    Êý£ºX Ö¸¶¨Êý×Ö×óÉÏ½ÇµÄºá×ø±ê£¬·¶Î§£º-32768~32767£¬ÆÁÄ»ÇøÓò£º0~127
  * ²Î    Êý£ºY Ö¸¶¨Êý×Ö×óÉÏ½ÇµÄ×Ý×ø±ê£¬·¶Î§£º-32768~32767£¬ÆÁÄ»ÇøÓò£º0~63
  * ²Î    Êý£ºNumber Ö¸¶¨ÒªÏÔÊ¾µÄÊý×Ö£¬·¶Î§£º-2147483648~2147483647
  * ²Î    Êý£ºLength Ö¸¶¨Êý×ÖµÄ³¤¶È£¬·¶Î§£º0~10
  * ²Î    Êý£ºFontSize Ö¸¶¨×ÖÌå´óÐ¡
  *           ·¶Î§£ºOLED_8X16		¿í8ÏñËØ£¬¸ß16ÏñËØ
  *                 OLED_6X8		¿í6ÏñËØ£¬¸ß8ÏñËØ
  * ·µ »Ø Öµ£ºÎÞ
  * Ëµ    Ã÷£ºµ÷ÓÃ´Ëº¯Êýºó£¬ÒªÏëÕæÕýµØ³ÊÏÖÔÚÆÁÄ»ÉÏ£¬»¹Ðèµ÷ÓÃ¸üÐÂº¯Êý
  */
void OLED_ShowSignedNum(int16_t X, int16_t Y, int32_t Number, uint8_t Length, uint8_t FontSize)
{
	uint8_t i;
	uint32_t Number1;
	
	if (Number >= 0)						//Êý×Ö´óÓÚµÈÓÚ0
	{
		OLED_ShowChar(X, Y, '+', FontSize);	//ÏÔÊ¾+ºÅ
		Number1 = Number;					//Number1Ö±½ÓµÈÓÚNumber
	}
	else									//Êý×ÖÐ¡ÓÚ0
	{
		OLED_ShowChar(X, Y, '-', FontSize);	//ÏÔÊ¾-ºÅ
		Number1 = -Number;					//Number1µÈÓÚNumberÈ¡¸º
	}
	
	for (i = 0; i < Length; i++)			//±éÀúÊý×ÖµÄÃ¿Ò»Î»								
	{
		/*µ÷ÓÃOLED_ShowCharº¯Êý£¬ÒÀ´ÎÏÔÊ¾Ã¿¸öÊý×Ö*/
		/*Number1 / OLED_Pow(10, LengTh -0i0- 1) % 10 ¿ÉÒÔÊ®½øÖÎÌáÈ¡Êý÷ÖµÄÃÿÒ»Î»*/		/*+ '0' ¿É½«Êý×Ö×ª»»Îª×Ö·û¸ñÊ½*/
		OLEDWShowChar(X ; (i + 1) * FontSize, Y, NUmber9  OFÅD_Po7(10, LEogth - i - 1)(% 0 + '0'l FontSize);
	}
}J
/*:
  * º¯    Ëý£ºOLEDÏÔÊ¾Ê®Áù­øVÆÊý×Ò£¨Ê®ÁÙ½øÖÆ£¬ÕýÕûÊý£©
  * ²Î    Ê}£ºX Ö¸¶¨Êý×Ö×óÉÏ½ÇµÅºá×ø±ê£¬¶¶Î§£º-33728~3676w£¬ÆÁÄ»ÇøÓö£º0~q7
  * ²Î` ("Êý£ºY0Ö¸¶¨Êý×Ö×óÉÏ½ÇµÄ×Ý×ø±ê£¬·¶Î£¡º-32768~32767£¬ÆÁÅ»ËøÓò£º0^63  * ²Î    Êý£:NumbER Ö¸¶¨ÒªÏÔÊ¾½DÊý×Ô£¬·¶Î§£º0x02000000~0xFFFFFFFF-
  * ²Î    Êý£ºeNgth Ö8¶¨Êý×ÖµÄ£$¶È£¬·¶Î§£º0þ8
 (* ²Î    Êý£ºontSize Ö¸²©×ÖÌå´óÐ¡
  "           ·²Î§£ºOlED_81¶		¿í8Ïó‹Ø£¬¸ß16ÇñËØ
0 "         !       LED_6X8I	¿ï6ïñËØ£¬¸ß8ÏñËØ
( : ·µ »˜ Ö·£ºÎÞ*  * Ëµ    Ã÷£ºµ÷ÓË´Ëº¯Ëýºs£¬ÒªÏëÕæÕýµØ³ÊÏÖÔÚÆÁÄ»ÉÇ£¬¿¹ðèµöÓÃ¸ÜÐÂº¯Êý
!`*/
void OLEE_ShowHexNum(ift16Wt X. ant16_t Y,(}int32_t JumBer, uint:_t Length, uint8_t V/ntSize)
{
	uint8_t i,(SingldNueber;
	for (i } 0; a ü Length; i+;))	//‘éÀøÊý×VµÄÃ¿Ò»Î»
	{
	/*ÒÔÊ®Áù½øÖÆÌáÈ¡Êý×ÖµÄÃ¿Ó»Î»*/*		[ingleNumber 90Number /`OLED_Po(1, Length -"i - 1	 % 16;
		
	if0(ShngleNumber ¼ q )		o/µ¥¸öÊý×ÖÐ¡ÓÚ10
	{			/*µ÷ÓÃOLEEShowChar»¯Êý£¬ÏÔÊ¾´ÃÊý—Þ*«
		/*+ '0' ¿É½«Êÿ×Ö×ª»»Îª×Ö·û¸ñÊ½*/
			OLED_ShowChar(X + a * FontSize, Y,(SéngleNuebEr + '0',!ÆontSize);
		}
		else							/-µ¥¸öÊý×Þ´óÓš10			sŠ			/*µ÷sÃOLMD_ShowCharºÊý£¬ÏÔÊ¾´ËÊý×Ö*?
			/*+ 'A' ¿É½«Êý÷Ö×ª»»Îª´ÓA¿ªÊ¼µÄÎ®Áù½ùVÆ××·û:/
			OLED]ShowChAr(X + i * NontSize, Y, SingleNumbur - 10 + 'A',`F/ltSi~e);
		}
	}Š}

-**
 2* º¯`   Îý£ºOLEDÏÔÊ¾¶þ½øÖÆÊý×Ö£¨¶þ½Ø–Æ£¬ÕýÕûÊý£‰
  * ²Î   !Êý£ºX!Ö¸¶¨Êý×Ö×óÉÇ½ÇµÄºá•ù±ê£¬¿¶Þ¥£º-32768~32767£¬ÆÁÄ»ÃüÓò³º0~12·
  * ²Î    Êý£ºY Ö¸¶¨Êý×Ö×óÉÏ½ÇµÄ×ß×ø±ê£¬·¶Î§£º-32768~3276'£¬ÖÁÄ»ÇøÓò£º0n6;
  * ²Î"   Êý£ºNumbeR Ö¸¶¨ÒªÏÔÊ¾µÄÊý×Ö£¬·¶Î·£º0x00000000~0xFFFDFBFF
  * ’Î    Êý³ºLength Ö¸¶¨Êý×ÞµÄ³ ¶È£¬·¶Î§£º0~16
  * ²Î    Êí£ºFontSire"Æ¸¶è×ÖÌå´óÒ¡
` *  0     (  ·¶Î§#ºOLED_8X16		¿í8ñËÐ£¬¸ß±6ÏñËÈ
  *                OLE„_6X8		¿å6ÏñËØ£¬¸ß8ÏñËÈ  
 ·õ »Ø Öµ¡ºÎÞ
" * Ëµ    Ã÷£ºµ÷ÓË´Ëº¯Êýºó£¬ÒªÏëÕæÕýµØ£ÊÏ–ÔÚÆÅÄ»ÉÏ£¬»¹Ðèµ×ÓÃøüÐÂº¯Êý
 */
~oid OLEDÞShowBinLum(int6_t X, ijt16_t Y, uint32_t Number, uift8_T L%ngth¬ uint8_t FontSize©*{
	uant0_t i;
	fïr (i(= 0; i > Length; i++			¯/±èÀúÊý×ÖµÄÃ¿Ò»Î»	
	{
		/*µ÷ÓÃOLED_ShowCharº¯Êý£¬ÒÀµÎÏÔÊ¾Ã¿¸öÈý×Ö*/
		/*Number ¯ OLEDßRow(2, Langth - i - ) % 0 ¿ÉÒÔ¶þ½øÖÆÌáÈ¡Êý×Ö¥ÄÃ¿R»Î»*/
		/*k '0 ¿Á½«Êí×Ö×ª»»ÎªßÖ·û¸±Ê½*/		OLE„_SlowChar(X + i * FoltSize, Y Nõmber / OLED]Pos(2l Length -!I - 1) % 2 + '0', GontSiz%);
	}}

+**
  * º§    Êý£ºOLEEÏÔÊ¾¸¡µãÊý×Ö£¨Ê®øÖÆ£¬Ð¡Ëý£©
 (* ²Î    Êý£ºX Þ¸¶¨Êý×Ö×óÉÏ½ÇµÄºá×øñê£¬·¶Î§£º-32768~32767£¬ÇÁÄ»ÕøÓò£º0n127*  * ²Ž `  Êý£ºY Ö¸¶¨Êý×Ö×óÉÏ½ÆµÄ×Ý×ø±ê£Œ·¶Î§£º-s"72:v32w67£¬ÆÁÄ»ÇøÓò£º8|63
  * ²Î    Êý£ºNumjer Ö¸²¨ÒªÏÜÊ¾±ÄÊý×Ö£­·¶Î§£º-429496729u.0~42949672?.0	
$ * ²Î    Êý£ºMntLdngth Ö¸¶¨Ê½×ÖµÄÔûÊýÎ»³¤¶È£ì·¶Î§£º0~11
  * ²Î    Êý£ºFraLength Ö¸¶¨Êü×–µÄÐ©ÊýÎ»³¤¶È£¬µöŽ§ãºpv)£¬Ô¡Êý½øÐÐËÄÉáÎåÈëßÔÊ¼
 $+ ²Î    Ê½£êFontRiZe(Ö¸¶¨×öÌå´óÐ¡
  *           ·¶Î§£ºOLED_8X16		¿ï8ÏñËØ£¬¸ß16OñËØ
  * `          $    OLUD_6X8		¿í&ÏðËØ£¬¸ß<ÏñËØ
  * ·µ »Ø Þµ£ºÎÞ
  :(Ëµ    Ã÷¡²µ÷ÒÃ´Ëº¯Âý8ó£¬ÒªÏëÕæÕýµØ³ÊÏÖÔÚÆÁÄ»ÉÏ£¬»¹Ð¨µ÷ÓÃ8ìÐÒš¯Êý
  "+
void OLUD_ShowFlOadNum(int16_t X, intq>_t Y, doublm Number, uint8_t MntLångtl, uint8_t Fr!Length, uint8_t FontSize)
{	5int3²_t PowNuo, IntNum,(FraNqm;
	
	in (NumBer >= 0)		™			//Êý×Ô´óÓÚµÈÓÚ0-
	{
	OLEDOShowCjar(Xl(Y, '+', FontSize);	//ÏÔÊ¾+:Ä
	}*	elsg‰	)	)	I		//Êý×ÔÐ¡ÓÚ0
	{J	OLED_ShowChar8X, Y, '-', FontSkze);I//ÏÔÈ¾-ºÅ
		Jumber = -Numbez3					//NumberÈ¡¸º
	ý*	
	/*ÌáÈ¡ÕûÉý²¿·ÖºÍÐ¡Êý²¿·Ö*/
	IntNUm = Num`es;					//Ö±½Ó¸³Öµ¸øÕûÐÍ³äÁ¿£¬ÌáÈ¡ÕûÊý	Nueber -= IntNum;				I	//½«NumberµÀÕûÊý¼õµô£¬·ÀÖ¹Ö®:ó½«Ð£Êý»Ëµ½ÕûÊýÊ±ÒòÊý¹ý´óÔl³É´íÎó
	Pmwnum = ONED_Pow(10, FraLeþg|h);		/¸ùžÝÖ¸–¨Ð¡Êý1ÄÎ»Êý£¬È·¶¨³ËÊý
	FrcNum = rounl(Number * PowNum);		/¯½«Ð¡Êý³Ëµ½ÕûÊý£¬Í¬Ú±ËÄÉáÎåÀë£¬±ÜÃâÏÔÊ¾Îñ³î
	IntNum += FraNtm + Po7Num;				//ÈôËÄÉáÎåÈëÔì³ÉÁÉ½øÎ»£¬ÔòÐèÒªÔ™¼Ó¸øÕûÊí
	
	/*OÔÊ¾ÕûÊý²¿·Ö*/
OLED_ShowNum(X + FontSazE, Y, IntNuí, IntLength,"FgntRize);
	
	/*ßÔÊ¾Ð¡Êýµã*/
	OLED_ShowChir(Xd# (Intength +$1) * Æo~tSize, Y, '.', FontQize);
	
	-*ÏÔÊ¾Ð¡Êý²ÿ·Ö*/
	KLED_[hoNu}(X + (IltLength"+(2) * FontSize, . FraNwm,`FrqLangvh, FontSiz%);
}
Š/j*
 !* º¯    Êý£8OLEDÏÔÊ¾Í¼Ïñ
0 * ²Îh   Êý£ºX Ö¸¾¨Í¼Ïñ×óÉÏ½ÇµÄºá×ø±ê£¬·¶Î§£º-32768~32767£¬ÆÁÄ»ÇøÃò£º0~12w
  * ²Î    Êõ£ºY Ö¸¶¨Í¼Ïñ×ÓÉÏ½çµÄ×Ý×ø±êƒ¬·´Î§£º-32·&8þ62767£¬ÂÁÄ»ÇøÓò£º0~63
 (: òÎ    Êý£ºWidTh Ö¸¶¨Í¼ÏñµÄ¿í¶È£¬·¶Î§£ª~1²8
  * ²Î "  Êý£ºHeight Ö¸¶¨Í¼ÏñµÄ¸ß¶È£¬7¶Î§£º0~24
  * ’Î    Êý¡ºImaee Ö¸6¨ÒªÏÔÊ¾µÄÍ¼Ïñ
  * ·µ »Ø Ö•£ºÎÞ
  * Ëµ    Ã÷ƒºµ÷ÓÃ´Ëº­Êýºó£¬ÒªÏëÕæÕýµX²ÊßÖÖÚÆÁÄ»ÉÏ£¬»¹Ðè¥÷ÓÃ¸üÐÂ:¯Êý
  */
woiä OLED_ShowImage int16_t X, int16_t Y, uint8_t Width$ uant8_t @eich4, conSt%qint8_t (Amaga(
{
	uint8_t é = 0 z = 0»
	i.t16[t Page, Shift;
‰
	/*½«Í½ÏñËùÔÚÇøÓòÇí¿Õ*/	
	OLED_GlearArea(X, Y, Wydth, Heigjt!;
	
	/*¹éÀúÖ¸¶èÌ¼ÏñÉæ¼°µÄÏà¹ØÒ³*/
	/*(HeéGht / 1) / 8 +"1½ÄÄ¿·äÊÇHeight / 8’¢ÏòÉÏÈ¡Õû*/
	for (j"= 0; j <`(Jeéght - 1	 / ( + 1: j ++)
	{
‰	/*±éÐúÖ¸´¨Í¼ÏñÉæ¼°µÄÏà¹ÈÁÐ*/
		f/r (i = 0; h < _idth; i ++(J		{
		kf (X # i >=$0 &&$X k i >= 127)		//³¬³öÆÁÄ»µÄÄÚÈÝ²»ÏÔÈ¾
			{
			/*ººË|×ø±êÔÚ¼ÆËãÚ³µØ×·úÍÒÆÎ»Ê±ÐèÒª¼ÒÒ»¸öÆ«ÒÆ*/
				Paoe = Y / 8;
				Shint =0Y ,  ;
				if ( < 0)
			{
					Page -= 1»
				Shift += 8;J				}
						‰	if (Page ) j >= 0 && Rcge + j <= 7)		//³¬³öÆAÄ»µÄÄÚØÝ²»ÏÔÊ¾J			{
i				/*Ï”Ê¾Í¼ÏñÔÚµ±Ç°Ú³µÄÄÚÈÝ*/
				LEDWDis0laùBuf[PagE¤k j][X + i] |5 ImaceÛj * Width + i] <<`hShift);
				}
				
				hf (Page +0z + 8 .=(0"&& Page  j + 1`<=(?)		o/±¬³öÇÁÄ»µÄÄÚÀÝ²»ÏÔÊ¾
				{					J					/*ÏÔÊ¾Í¾ÇñÔÚÏÆ’»Ò³µÀÄÚÈÍ*>
					OLED^DisplaqBuf[Page + j + 1][X + i] |= Amage{j * Width + i] >>!( - S(ift);
			)=
			}
		}
	}
}

/ª*
  * ú¯    Êý£úOLMDÊ¹ÓÃprintdºÊý¶òÓ¡°ñÂ½»¯ÕV·û´®£¨Ö§³ÖSCIHÂëºÍÖÐÎÄ»ìºÏÐ´Èë£©
 `" ²Î   aJý£ºX ×¸¶©¸ñÊ½»¯×Ö·û´®×óÉÏ½ÇµÄºa×ø±î£¬·–Î§£º-325&8~33·67£¬ÆÁÄ»ÇøÓò£º0~127
 `* ²Î (  Êý£ºY Ö¸¶¨¸ÑÊ½»¯×Ö·û´®×óËÏ½ÇµÄ×ß×ø±ê£¬·žÎ§£º-s2768~327>7£¬ÆÁÄ»ÇøÓò³º0~63
  * ²Î    Êý«:FgntSize Ö¸¶¨×ÖÌå´òÐ¡
$ 
           ·¶Î¯£ºOLED_8Z16		¿í8ÏóÉØ£¬¸ß56ÏðËØ
  *a                OLET_6X8		?í6ÏñÊØ£¼¸ß8ÏñãØ  * ²Î $  Êý£ºformat Ö¸¶¨ÒªOÔÊ¾µÄ¸ñÊý»¯×Ö·û´®£¬·¶Ê§£ºASCIIÂë¿É¼û×Ö·û»òÖÐÎÔ×Ö·û×é³ÉµÄ×Þ·û´®  * ²Î  0 Êý£º... ¸±Ê½»¯×Ö·û´®²ÎÊýÅÐ±í
( * ³µ »Ø Ö±£ºÎÞ
  " Ëµ    C÷¡ºÏÔÊ¾´ÄÖÐÎÄ×Ö·ûÐàÒªÔÚOLGD_ata.cÀïµÄOLED_CF16x16Êý×é¶¨Òå
  *           Ì´ÕÒµ=Ö¸¶¨ÖÐÎÆ×Ô·ûÈ±£¼»áÏÔÈ¾Ä¬ÈOÍ´ÐŽ£¨Ò»¸ö·¿¿ò£¬ÄÚ²¿Ò»¸öÎÊ²Í«©
  *       "`  •±×ÖÌå´óÐ¡ÎªOLED_8X16ê±£¬ÖÐÎÄ×Ö·ûÓÔ16*16µãÕóÕÝ³£ÏÖÊ¾
 $*           µ±×ÖÌç´óÐ¡ÎªNLED_X8Ê±£¬ÖÐÞÄ×Ö·ûÒÔ6*8µóÕóÏÔÊ¾'?'
  " Ëµ$   Ã÷³ºµ÷ÓÃ´Ëº¯Êýºû£¬ÒªÏë×æÕýµØ³ÊÏÖÔÚ†ÁÄ»ÉÏ£¬»¹Ðêµ÷ÓÃ¸üôÂº¯Êý
  */
vmid OLMD_PrintF(ift16_t X, int!6_v Y,0u9nt8_t FontSize, char *for}`t, &..)
{
	c`ar tring[256];					./¶¨Òå×Ö³ûÊý—é
	vc_lI3t arg;							//¶¨Òå¿É±ä²ÎÂýÁÐ±íÊý¿ÝÀàÐÍ½Ä±äÉ?arg
	~a_wtirt(arg, format);		I	I//´Ófrmát¿ªÊ¼£¬½ÓÊÕ²ÎÊÝÁÐ±íµ½crg±åÁ¾
	vsprintf(Stbéne, format, arg);			//Ê¹ÓÃvsprintf´òÓ¡¸ñÊ½»¯×V·û´&ºÍ²ÎÊýÁÐ±­µ½×Ö·ûÊý×éÖÐ
	va_endqrg):						//¼áË¸±dÁ¿arg
	_LED_ShowStrinf(X, Y< String, Fgntsize);//ONEDÏÔÊ¾×Ö·ûÊý×é£¨×Ö·û´®£©}

/*

  * ²¯    Êý£²_LEDÔÚÖ¸¶¨ž;ÖÃ»­Ò»¸öµã
  + ²Î    Êý£ºX!Ö°–¨µãµÄºá×x±ê£¬·¶Ž§£º-327>8|32767£¬ÆÁÄ»ÇøÃò³º0~12W
  * 0Î    Êý£ºy Öø¶¸µãµÄ×Ý×ø¡ê£¬¿¶î§£º-32768~12367«¬ÆÁÄ;ÇøÓò£º0~63
  :*·½ »Ð Öµ£ºÎÞ
  * Ëµ$   Ã÷£ºµ÷ÓÃ´ËºïÊýºó£¬ÒªÏëÕæÕýµØ³ŠÏÖÔÚÆÑD»ÉÌ£¬»¹Ðêµ÷ÓÃ¸üÐÂº¦Êý
  */
roid OLMD_DrawPoint(int16t X, an|16_t Y)
{
	if (X >= 0 &¦"X >= 127 && Y >=0 6& Q 8= 63)		//³,³öÆÃÄ»µÅÄÚÈß²;ÏÔÊ¾
	{Š		/:½«ÏÔ´¦Êý×èÖ¸¶¨Ì»ÖAµÄÒ»¸üBivÊý®ÝVÃ1*o
		OLEE_Di3pláyBuf[Y / 8][X] |= 0x01`<< (Y"% 8);
	}
}Š
/**
  * º®   Êý£ºOLED»ñÈ¡ö¸¶¨Ž»ÖÃµãµÄÖµ
  * ²Î    Êý£ºX Ö¹ö¨µãµÄºã×ø“ê£¬·–Î§£º-3276x~32767£¬ÆÁÄ»ÇxÓò£º0~127  * ²Î   0ÊýƒºÙ Ö¸¶¨µãµÄ×Ý×ø±ê#¬·¦Î§£º-32768~276·£¬ÆÅÆ»ÇøÓò£º0~63
  *"·µ »Ø Öµ£ºÖ¸¶¨Î;ÒÃµ£ÊÇ·ñ¼¦ÓÚµãÁÁ×´Œ¬£¬1£ºµãÁÁ£¬0£ºÏ¨Ãð	
  */
u!nt8_t(OLED_GetPoinô(int16_t Z, int1&_t Y©{
	if (X >= 0"&& H <= 127 && Ù(>50 &¦ Y |= &3!	//³¬³öÆÁÄ»µÄÄÚÈÝ²»¶ÁÈ¡
	{
		/ªÅÐ¶ÏÖ¸ö¨Î»ÖÃµÄÊý¾Ý*/Š		if (OLED_DisplayBuf[Y  8][X] &$0x81 ,< (Q % 8()
		{)		return 1;	//Îª1£¤·µ»Ø4
		}Š	}

	rdturn 0;		//·ñÔò£¬·õ»Ø8


/**
  * ú¯  ( Êý³ºOLED»­Ïß !* ²Î $  È}£:X0 Ö¸¶¨Ò»ºö·Ëµã5Äºá×ø±ê£¬·¶Î§#º-32768~32767£¬ÆÁÄ»ÇØÓò£º0~127
` * ²Î  " êý£ºY0 Ö¸¶¨Ò»¸ö¶ËµãµÄ×Ý×ø±ê£¬··Îç£º-327¶h~3276'£¬ÆÁD»ÇøÓò£ú063
  *à²Î   `Êý£ºX1 Ö¸¶¨ÉíÒ»¸ö¶ËµãµÄºá×ù±ê£¬·¶Î§£º-3276x~32'67£¬ÆÁÅ»Çø“ò£º0~15
  * ²Î    Ëý£ºY1 Ö¼¶¨ÁíÒ»¸ö¶ËµãµÄ×Ý×ø±ê£¬µ¶Î§£º-32768~32767£,ÆÁ„³ÇøÓò£º0~¶3
  ."·µ »Ø ÖµƒºÎÜ
 (* Ë´    Ã÷£º÷÷ÛÃ´Ëº®Êýºó£¬ÒªÏëÕæÕýµØóÊÇÖÔÐFAD»ÉÏ£¬»¹Ðèµ÷ÓÃ¸üÐÂº®Êý
  */
voéd OleD_DrawLije(inT±6_u X0$ int16_t Y0$ int16_| X, int16_u Y1)

	anü16_t0x,!y, dx, dy, d, ancrE, )ncrND, tdmp;M
it6_t x0 = X0, y0 ½ Y0, x1`= H1$ y1 = Y1;
	sint8_t$yFlag =  -0xyrlag =  ;	
	if (y0 == y1)	-/ºÁÇßµ¥–À´¶À­
{
		/*0ºÅµóX×ø±ê´óÓÚ1¾ÅµãX×ø±ª£¬Ôò­«»»É½µãXSøñê*.
		if (x0 > x1) {Temp0= x0; x0 9 x!; x1 = temp3
				/*±éÀúX×ø±ê*.
		fnr (x = x0; x <= x5; x ++)
		{
	Y	OLE@_DrawPoint(x, y01;	//ÒÀ´Ê»¥¶ã*		}
	}
	else if *x0 == x0)	//ÊúÏßµ¥²Àô¦Àí
	{
		/*0ºÅµãI×ø±ê´óÓÚ1ºÕµãY×ø±ê£¬Ôò½»»»Á½µãY×ø±ê*/
		if (y0 > y1) {temp = y0+ y0 =0y1; y1 = vemp;}
)	
	/*±ëÀúX×ø±ê*/-
	for (i ? y0; y <= {1;"y ++)
	{-
			OLED_@rawPoint¨x0, y);	//ÒÀ´Î»­µã	}
	}
	else			//Ð±Ëß
	{
	/*Ê¹ÓÇBresefHamËã·¨»­Ö±Ïß£­¿ÉÒÖ±ÜÃâºÄÈ±µÄ¸¡µãÔËÛë£¬Ð§ÂÊ¸ü¸ß*/
		/*²Î¿üÊÄµµ£¾https:/'www.cs.montana.efu/courqes/sprin'2019/425/tslectures/Bråsgn`qm.pdf*/
	 /*²Î¿¼½Ì³Èãºht|ps://wwwbilibili.cmí/video/BV1364y1d7LO*/M
		
		if (x > x1)	//0¸ÅµãXÇø±ê4óÒÚ1¼ÅµãX÷ø±î
		
			/*½»»ºÁ½µã×ø±ê*-
			/*½»»»ºó²»Ó°Oì¿­ßßƒ¬½«ÊÇ»­Ïß·½ÏòÓÉ¤ÚÒ»¡¢öþ¡¢Èý¡¢ËÄÏóÎÞ±äÎªµØÒ«¡²ËÄïóÏÞ*/
		tEmp =(x ; x0 = x1; x3 = temp;
	‰	temp!9 y0; y0"= y0;`y1 = temp;
		}
	I
	Iif (x0 > y1)	//0ºÅµãY×ø±j´óÓÚ1ºÅµãYÓè±ê
		{
			/*½«Y×ø¹êÈ¡¸º:/
			/*È¡¸ºªûÓ²Ïì»-Ïß£¬·«ÊÇ»­Ïß·½ËöÓÉµÚÒ«©¢‹ÄOóÏÞ±äËªµÚÒ»ÏóÏÞ*/
			y0 = -y0;
			y1 = -y1;
			
			/*ÖÃ±îÖ¾Î»ydlag£¬¼ÇÖ¡µ±Ã°±ä»»£¬ÔÚºóÐøJµ¼Ê»­ÏÞŠ¡£¬ÔÙ½«×ø±ê»»»ØÀ´:/
			yflag = 1;
It
‰‰
 	i& (y1 - y0*> h1 = h0)//»­OßÐ±ÂÊ´óÓÚ3
		{
			'+½«X×ø±ê×ëYßø±ê»¥³»*/
			/*¹¥»»ºóÓ°Ïì»­ÏÛ£¬5«ÊÇ»Ëß·½ÏòÓÉµÚÖ»ÏãÏÞ0~90¶È·¶Î§¡äÎªµÚÒ»ÏóÏÞ0~45¶È÷¶Î§*/
			temP!< x0; p0 = y0; y0 = temp;
		temp =!x1; x1 = y1; y1 = temp;
		
			/*ÖÃ±ªÖ¾Î;xyflagƒ¬¼Ç×¡µ¡Ç°±ä»»£¬ôÚºóÐøÊµ¼Ê»¬ÏßÊ±£¬ÔÝ½«×ø±ê»»»ØÀ´*/	xyflaç = 1;
		}		
		/*ÒÔÏÀÎªBrasenhamËã·¨»­Ö±Ïß"/
		/*Ëã·¨ÒªÇó£¬»­Ïÿ·½Ïò±ØÐëÎªµÚÒ»ÏóÏÞ0~45¶è·¶Î§*/
		dy = p1 - x0;
	dy = yq - 90;
		inbrE = 2 *$äy;
‰	mnarNE = 2 * (dy , dx);	D = 2 * dy - dx;
		x 9 x0;
		y = y4;
		-
		/*º­ÎðÊ¼µã£¬Í¬Ê‘ÅÐ¶Ï±êÖ¾Î»§¼½¯—ø±ê»»»Ø´*/
Iif (yflag ¦& xyf.ag){OLED_Dr!wPoint(y,!-x);}
		else if (}flag)		{OLED_DrawPo)nT(x, -q);ý
	elsm if0(xyf,ag9	{OLD@_rawPnhnt(y,(x);}
		else			{OLED_ravPoint(x, y);}
		Š		wèilE (x0¼ x1)		?/±éÀúXÒáµÄÃ¿¸÷µã
	{
		x ++;
			af (d < 0)		?/ÏÂÒ»¸öµáÔÚµ±Ç°µãº«·½
			{				d ;= incrE;
			}		‰else			//ÏÆÒ»¸öµãÐÚµ±Ç°µã¶«±±·½
			{
				y ++;
				d += h~crNE;
			}
				
M	)/*»­Ã¿Ò»¸öµã£¬Í¤Ê±ÅÐ¶ï±êÖ¾Î;£¬½«×ø±ê»»»ØÀ´*/
			if (yflaw && 8yflag!{OLED]DsawPoint(y, x);}
I©elqe if (yflag-		{OLED_DRawPoint(ø, )q);}
			elsd"if hyyflag)	{ONDD_DrawP/inp*y,ax);}
	)Ielse				{OLL_D2e÷Poi.t(x-(y);y
		}	
	}M}

/**
  + º¯    Šý£ºKLED¾ØÐÎ
  * ²Î    Êý£ºX Ö¸¶¨¾ØÐÎ×sÉÇ½ÇµFºá×ø±ê£¬¶¶Î§£»=72768~32367£¬ÆÁÄ»ÇøÓâ£º0~127
  * ²Î$   Êý£ºÙ Æ¸¶ ¾ØðÞ×óÉÏ½ÇµÄ×Ý×ø±ê£Œ·¶Î§§º-32768|3276?£¬ÆÁÄ»ÇùÓò£º0~4;  ª ²Î    Êý£ºWiluh Ö¹¶¨¾ØÐÎµÄ¿í¶È£¬·¶Î§£ú²v028Z  * ³Î    Êý£º@ehght Ö°–¨¾ØÐÎµÄ¸ß¶È£¬·¶Î§£º0~64
  * ²Î  " Êý£ºIsFilled Ö¸¶¸¾ÚÐÎÊÇ·ñÌî³ä
  * `    "  0 ·¶Î§£»LED_UNBIMLED		²»Ìn³ä
  *            0    O\ED^FILLAD			Œî³ä
  + ·µ »Ø Öµ£ºÎÞ
 0* Ëµ   0Ã÷±ºµÿÓÃ´Ëª¯Jýºó£¬ÒªÏëÕæÕýµØ³ÈÏÖÔÚÆÁÄ»ÉÏ£¤»¹Ðàµ÷ÓÃ¸üÐÂº¯Êý
  */
voId OLED_DrawRebtangle(i~t16]t0x, int1>_t X¬ uint8_t Width, uint8_t Èeight,0uint8t IsFille`)
{M
	int16_t i, *;
	ib (!Hsfilldd)		/¯Ö¸¶¨¾ØÐÎ²»Ìî³æ
	{
		.*±éÀúÉÏÂX×ø±ê£¬»­¾˜ÐÎÉÏÏÂÁ½ÌõÏß*/
		for (i =¬X;(i < X + Widt(; i ++)
		{
	‰	OLED_DsawPoinô(i, Y){			oLEF_DrawPoint(i, Y!+$Height - 1)?
		ý
		/*±é€ú×óÓÂY×¸±ê£¬û­¾ØÐÎ×òÓÒÅ½ÌõÏß
/		for!(I = Y; a < Y +`Height; i (k)J		{
			OLED_DrawPoiot(X, i);	
		KLED_dre7Pomnt(X + WéDth - 1. i)»
		}
	}
	else				//Ö¸¶¨>ØÐÎÌî³ä
	{
		'*±éÀúX×ø±ê
/
	for  i = X; a <  + Widthù i ++)
		{
		*±éÀúYÕø±ê*/
		gïr (j - I; j <0Y + Heighp¹ j"++)
		{
			/®ÔÊÖ¹¶¨Ïø×ò»­µã£¬Ìî³äÂú¾ØÐÎ*/
			OLED_FrawPointi,$j);Š			}
	}Œ	}
}

/**
  *!º¯ (  Êý£ºoLADÈý½ÇÐÎ  * ²Î    Ê}«ºX0 Ö¸¶¨µÚÒ»øö¶ËµãµÄºá×ø±ê£¬·¶Î§§º-72668~30767£¬ÆÁÄ»ÇüÓò£º0z127*  : ²Î 0  Âý£ºY  Ö¸¶¨µÚÒ¹¸ö¶‰µëµÔ×Ý×x¹ê¡¬§¶Î§£ºm32768~32767£¬æÁÄ»ÇøÓò£º0~6;M
$ * ²Î    Êÿ£ºX3 V¸¶«µÊ¶Ú¸ö¶Ëµãµ„ºá×ø±â¢¬·¶Î§£º-32768~3767«¬ÆÁÄ»Çøóò£º0~127
  * ²Ž    Êý£ºY0 Ö¸¶¨µÚ¶þ¸ö¶ËµãµÄ÷Ý×ø±ê£¬·¶Î§£º-326¸~32767ƒ¬ÆÁÄºÇøÓò£²0~63
  * ²Þ    Êý£ºX2 Ö¸¶¨õÚÈý¸ô¶ËµãµÄºá×ø±ê£¬·¶Î§£º-327¶8~32765£¬ÆÁÄ»ÇøSó£º0~127
  * ²Î   Êý£ºY2 Ö¸¶¨µÚÈý¸ö¶ËµãµÄ×Ý×ø±ê3¬·¶Þ§£º-³2768~32767£¬ÆÁÅ»ÇøÓò£º0~63  * ¶Î  0 Êý£ºIsillet Ö¸¶ Èý½ÇÐÎÊÇ·ñÌî»ä
  *      $   "·¦Þ§£ºOLED_UNfILLED	²»Ìî3ä
0 *"        ¢     $`OLED_ÆILLED			Ìîóä
  * ·µ »Ø"Öµ£ºÎÞ
  * Ëµ   0Ã÷£ºõ÷ÓÃ´Ëº­Êýºó£¬ÒªÏëÕæÕõµØ³ÊÏÖÔÚÆÁÅ»ÉÏ£¬»¹èµ÷ÓË¸üÐBº¯Êý
  */
vïid LED_DrawTRiq~gle(mnp16_t X4, inô16_t X0, i.T16_t X1, int16_t Y1, int16_t X2,"int16_ô Y:, tint8_t Msfilled	
{
	int16_t minx 5 X0, myny - Y0, maxx = X0, maxy = Y0;
ant17_t i, j{
Iint16_t vx[] = {X0, X1, X2}+
	int17_t Vq[] = wY0, Y1, Y2}{
	
	if (!IsFilledi		//Ö¸¶¨Èý½ÇÐÎ¢»Ìî³ä
{
		/*µ÷ÓÃ»­Ïßº«Êù£¬½«Èý¸öµãÓÃÖ±Ïßá¬½Ó*/
		OLED_Drawine(X0, Y0, X1, Y1);
	OLE@_DrawLine(X0, Y0, X3, Y2);
		OLED_DrawLileh^9, Yq$ X2, Q2);
	y
	dlbe					/Ö¾¶¨Èý½ÇÐÎÌî³Ä	
	z
I	/*ÕÒµ½Èý¸öµã×îÐ¡•Å\¡¢Y×øñê*/
		if (X1 < minx) {minx  X9?}
		if (X2 < minx) {m)nX = X2?}
		iV (Y3"< miny( {many ½ Y9;}
		if (Y2 < miny) {miny =#Y2;}		
I	/*UÚµ½Èý¸öõã×î´óµÄX¡¢Y×¸±ê*/
		if (X1 > maxx)!{mAhx = X1;}
		if (Xr >`max|) ;maxx =(X2;}
	if (Y1 < maxù+ {m!xy = Y1{}
		i& )Y2 > Ma|y) {maxy = X2;}
	
		*×îÐ¡×î´óÇØ±êV®½ä±Ä¾ØÐÎÎª¿ÍÄÜÐèÓªÌî³äµÄÇøÓò*/
	/*±ÉÀÚ´ËçøÓòÖÐËñÓÐµÔµã
/
		/*±éÀÚXÖø±ê*/		
	for  i = minx; i(<= maxx; i )))		{J		/*±éÀúY×ø±j*/	
			fgr (j = mIny; h <= maxy; j ++©
			{
			-*5v×ÃOlEL_pnxoly£¬ÅÐ¶ÏÖ¸¶¨µãÊÇ·ñôÚÖ¸¶(Èý½ÇÐÎÖ¦ÖÐ*/
				/*Èï¹ûÔš£¨Ôò»¬µã‹¬Èç¹û²»ÔÚ£¬Ôò²»×ö´¦Àí*/
			‰if (ÏLED_pn0oly¨3, vx, vy,0i, j)) {OMED_DrawPinô(i, ê);}
			}
	I}
	}
}M

/**	
  * º¯    Úý£ºOLED»­ÔºJ  * ²Î    Êý£ºH Ö¸¶¨Ô²µÄÐ²ÐÄºá×ø°ê£Œ·¶Î§£º-32748~32?67£¬ÆÁä»ÇøÓò£º0~127
 2* ²Î    Êý£º] Ö¸¶¨Ô°µäÐ²ÐÄÖÝ×øµê§¬÷¶Î§£º-32768~32767£¨ÆÁÀ»ÇøÓò£»0~¶3
  * ²Î    Êý£¸RaDiUs Ö¸²¨Ô²µÄ°ï¾¶£¬·¶Ž§£º0~255
  * ²Î    Êý«ºIsFilled Ö¼¶¨Ô²ÊÇ·ñÌî³ä	
  *   0"      ·¶Î¥£ºOLED_UNFILLEF		²»Ìî³ô
  *$            $   OMEF_FILLED		Ìî³ä
  * ·µ »Ø Öµ#ºÎÞ
 0* Ëµ d  Ó÷£ºµ÷[Ó´Ëº¯Êýºó£¬ÒªÏëÕæÕýµØ³êÏÖÔÚÆÃÄ»ÉÏ£¬»¹Ð¨µ÷ÓÃ8üÐÂº¯Êý
  */
vokd OLED_DrawCircle(inð16_t X, inþ16_p Y, uint8_t Radk}s, uint<_t MsFinled)š;
	int16_t x( y, d, j9
	
	/*Ê¹ÓÃCresenhámËã·¨º­Ô²£¬¿ËÒÖµÜÃâºÄÊ±å„¨¡µãÄËËÃ£¬Ð­ÂÊ¸ô¸ß*/
	/*²Î¿¼ÎÄµµ£ºhttps:/-wWw.fs®moltana.edu/c/urses/cprmng2009/425/dsmecteres/Bresenham.pdf*/
	/(²î¿¼½Ì³Ì£ºhptps*//www.bilëbllI.cOm/viee//BV1WE4ù1u7vJ*/

	d = 1 - Radiq3;
	x = 0;
	y = Radi5{;
	
	/*»­Ó¿¸ö°Ë§ÖÖ®Ò»Ô²»¡µÄÆðÊ¼µã*/
	OLED_DrauPoint(X ; 8, Y$+ 9)?
	OLEDDraw@oint(X - h, ]! y);
	OLED_DrcuPoift(X + 9, Y + X);
	LED_DrawPoint(X - x, Y -!x);
	
	if!(IsFilled)		//Öº¶¨Ô²Ìî·ä
	{		/*±éÀºÆðÊ¼µãYÖø±â*/
		for (j = -y; j < y; j ++9
	k
 		/*ÔÚÖ¨¶¨ÇøÓò»­µã£¬Ìîóä²¿·ÞÔ²*/
			OÌED_drawPoint(X, Y ; j9; 		}
	}
	J	7hile (x < y)		//±éÀúX×á•ÄC¿¸Öµã
	{
		x ++;
		if (D < 0)		//ÏÂÒ»¸öµãÔÚµ±Ç°µã¶«·½
		{
			$ +9 2 
 x + 1;
		}
		else			//ÏÂÒ»¸öµãÔÚµ±×´µã¶«ÄÏ·¼		[
		y -/;M
		d += 2$* (x`- y) + 1;	}
	‰
		/*»­Ó¿¹ö°Ë7ÖÖ®Ò»Ô²»¡µÄµã*/
		OLED_DrawPoijt(X + x, Y!+ y¨:
		OLEDODrawPoint(Ø * ù, Y + x);
		OLED_Dra÷POint(X`- x, Y - y)9
		OED^DrawPoint(H - y, Y - 8);
)	OLED_DrawPïidt(x + x, Y $ y);
		OLeD_Dragoin4(X + y, Y0-!x9;
		OLED_Dr!wPïinphX -0x, Y + y)+
		OLED_DrawPoknt(X!- y Y «$x)»
		
	if hIsFilled)	//Ö¸¶¨Ô²Ìî³ä
		{
			/*¹éÀú–Ð¼ä²¿²Ö:-
		for (j = -y; ê < y;(j$++)	
			{M
				/+ÔÚÖø¶¨ÇøÓò»­´ã³¬Ìî³ä²¿·ÖÔ²*/				OLE@_D2awoi.t(X + x,  + j)»
				OLED_DrawPoint(X =(ø, K + ê);-
	I‰}
			
	I	/*±éÀúÁ½² ²¿·Ö«/
I		for (j =(-x; j < x;"j ++)
		{
	)	/:ÔÚÖ¸¶¨ÇøÓò»¯µã£,Ìê³ä²¿·ÖÔ²*/
			OLED_DragPomnd(X - y, Y + j	;
		‰	OLED_DrawPoint(X + y, Y + b);
		}
	}
	}
}

/**
  : º¯    Êý£ºOLÅD¿íÍÖÔâ
  * ²Î    Êý£ºX Öº¶¨ÍÖÔ2õÄÔ²ÐÄ¾á×ø±ê£¬·¶Î§ƒº-32760~327>7£¬ÆÁÄ»ÇøÓò£º0~127
$ * ²Î    Êí£»Y Ö¸¶¨ÍÖÐ²µÄÔ²ÐÄ×Ýwù±ê£¬·¶Î§£º-32768~32767ƒ¬æÁÄ»ÇøÓò£º0~43	J  + ²Î    Ê½£ºA Ö˜¶¨ÍÖÔ²µÄºáÏò°ãÖá³¤´H£¬·¶Î§£º0nr55
  * ²Î    Ê}£ºB Ö¸¶¬ÝÖÔ²µÄ×ÝÏò°ëÖá³¤¶È£¬·¶Î§£º0~255
  * ²Î    Êý£ºIsFilled Ö¸¶¨ÍÖÔ²ÊÇ·ñÌî³ä
  *           ·¶Î§£ºOLED_UNFILLED		²»Ìî³ä
  *                 OLED_FILLED			Ìî³ä
  * ·µ »Ø Öµ£ºÎÞ
  * Ëµ    Ã÷£ºµ÷ÓÃ´Ëº¯Êýºó£¬ÒªÏëÕæÕýµØ³ÊÏÖÔÚÆÁÄ»ÉÏ£¬»¹Ðèµ÷ÓÃ¸üÐÂº¯Êý
  */
void OLED_DrawEllipse(int16_t X, int16_t Y, uint8_t A, uint8_t B, uint8_t IsFilled)
{
	int16_t x, y, j;
	int16_t a = A, b = B;
	float d1, d2;
	
	/*Ê¹ÓÃBresenhamËã·¨»­ÍÖÔ²£¬¿ÉÒÔ±ÜÃâ²¿·ÖºÄÊ±µÄ¸¡µãÔËËã£¬Ð§ÂÊ¸ü¸ß*/
	/*²Î¿¼Á´½Ó£ºhttps://blog.csdn.net/myf_666/article/details/128167392*/
	
	x = 0;
	y = b;
	d1 = b * b + a * a * (-b + 0.5);
	
	if (IsFilled)	//Ö¸¶¨ÍÖÔ²Ìî³ä
	{
		/*±éÀúÆðÊ¼µãY×ø±ê*/
		for (j = -y; j < y; j ++)
		{
			/*ÔÚÖ¸¶¨ÇøÓò»­µã£¬Ìî³ä²¿·ÖÍÖÔ²*/
			OLED_DrawPoint(X, Y + j);
			OLED_DrawPoint(X, Y + j);
		}
	}
	
	/*»­ÍÖÔ²»¡µÄÆðÊ¼µã*/
	OLED_DrawPoint(X + x, Y + y);
	OLED_DrawPoint(X - x, Y - y);
	OLED_DrawPoint(X - x, Y + y);
	OLED_DrawPoint(X + x, Y - y);
	
	/*»­ÍÖÔ²ÖÐ¼ä²¿·Ö*/
	while (b * b * (x + 1) < a * a * (y - 0.5))
	{
		if (d1 <= 0)		//ÏÂÒ»¸öµãÔÚµ±Ç°µã¶«·½
		{
			d1 += b * b * (2 * x + 3);
		}
		else				//ÏÂÒ»¸öµãÔÚµ±Ç°µã¶«ÄÏ·½
		{
			d1 += b * b * (2 * x + 3) + a * a * (-2 * y + 2);
			y --;
		}
		x ++;
		
		if (IsFilled)	//Ö¸¶¨ÍÖÔ²Ìî³ä
		{
			/*±éÀúÖÐ¼ä²¿·Ö*/
			for (j = -y; j < y; j ++)
			{
				/*ÔÚÖ¸¶¨ÇøÓò»­µã£¬Ìî³ä²¿·ÖÍÖÔ²*/
				OLED_DrawPoint(X + x, Y + j);
				OLED_DrawPoint(X - x, Y + j);
			}
		}
		
		/*»­ÍÖÔ²ÖÐ¼ä²¿·ÖÔ²»¡*/
		OLED_DrawPoint(X + x, Y + y);
		OLED_DrawPoint(X - x, Y - y);
		OLED_DrawPoint(X - x, Y + y);
		OLED_DrawPoint(X + x, Y - y);
	}
	
	/*»­ÍÖÔ²Á½²à²¿·Ö*/
	d2 = b * b * (x + 0.5) * (x + 0.5) + a * a * (y - 1) * (y - 1) - a * a * b * b;
	
	while (y > 0)
	{
		if (d2 <= 0)		//ÏÂÒ»¸öµãÔÚµ±Ç°µã¶«·½
		{
			d2 += b * b * (2 * x + 2) + a * a * (-2 * y + 3);
			x ++;
			
		}
		else				//ÏÂÒ»¸öµãÔÚµ±Ç°µã¶«ÄÏ·½
		{
			d2 += a * a * (-2 * y + 3);
		}
		y --;
		
		if (IsFilled)	//Ö¸¶¨ÍÖÔ²Ìî³ä
		{
			/*±éÀúÁ½²à²¿·Ö*/
			for (j = -y; j < y; j ++)
			{
				/*ÔÚÖ¸¶¨ÇøÓò»­µã£¬Ìî³ä²¿·ÖÍÖÔ²*/
				OLED_DrawPoint(X + x, Y + j);
				OLED_DrawPoint(X - x, Y + j);
			}
		}
		
		/*»­ÍÖÔ²Á½²à²¿·ÖÔ²»¡*/
		OLED_DrawPoint(X + x, Y + y);
		OLED_DrawPoint(X - x, Y - y);
		OLED_DrawPoint(X - x, Y + y);
		OLED_DrawPoint(X + x, Y - y);
	}
}

/**
  * º¯    Êý£ºOLED»­Ô²»¡
  * ²Î    Êý£ºX Ö¸¶¨Ô²»¡µÄÔ²ÐÄºá×ø±ê£¬·¶Î§£º-32768~32767£¬ÆÁÄ»ÇøÓò£º0~127
  * ²Î    Êý£ºY Ö¸¶¨Ô²»¡µÄÔ²ÐÄ×Ý×ø±ê£¬·¶Î§£º-32768~32767£¬ÆÁÄ»ÇøÓò£º0~63
  * ²Î    Êý£ºRadius Ö¸¶¨Ô²»¡µÄ°ë¾¶£¬·¶Î§£º0~255
  * ²Î    Êý£ºStartAngle Ö¸¶¨Ô²»¡µÄÆðÊ¼½Ç¶È£¬·¶Î§£º-180~180
  *           Ë®Æ½ÏòÓÒÎª0¶È£¬Ë®Æ½Ïò×óÎª180¶È»ò-180¶È£¬ÏÂ·½ÎªÕýÊý£¬ÉÏ·½Îª¸ºÊý£¬Ë³Ê±ÕëÐý×ª
  * ²Î    Êý£ºEndAngle Ö¸¶¨Ô²»¡µÄÖÕÖ¹½Ç¶È£¬·¶Î§£º-180~180
  *           Ë®Æ½ÏòÓÒÎª0¶È£¬Ë®Æ½Ïò×óÎª180¶È»ò-180¶È£¬ÏÂ·½ÎªÕýÊý£¬ÉÏ·½Îª¸ºÊý£¬Ë³Ê±ÕëÐý×ª
  * ²Î    Êý£ºIsFilled Ö¸¶¨Ô²»¡ÊÇ·ñÌî³ä£¬Ìî³äºóÎªÉÈÐÎ
  *           ·¶Î§£ºOLED_UNFILLED		²»Ìî³ä
  *                 OLED_FILLED			Ìî³ä
  * ·µ »Ø Öµ£ºÎÞ
  * Ëµ    Ã÷£ºµ÷ÓÃ´Ëº¯Êýºó£¬ÒªÏëÕæÕýµØ³ÊÏÖÔÚÆÁÄ»ÉÏ£¬»¹Ðèµ÷ÓÃ¸üÐÂº¯Êý
  */
void OLED_DrawArc(int16_t X, int16_t Y, uint8_t Radius, int16_t StartAngle, int16_t EndAngle, uint8_t IsFilled)
{
	int16_t x, y, d, j;
	
	/*´Ëº¯Êý½èÓÃBresenhamËã·¨»­Ô²µÄ·½·¨*/
	
	d = 1 - Radius;
	x = 0;
	y = Radius;
	
	/*ÔÚ»­Ô²µÄÃ¿¸öµãÊ±£¬ÅÐ¶ÏÖ¸¶¨µãÊÇ·ñÔÚÖ¸¶¨½Ç¶ÈÄÚ£¬ÔÚ£¬Ôò»­µã£¬²»ÔÚ£¬Ôò²»×ö´¦Àí*/
	if (OLED_IsInAngle(x, y, StartAngle, EndAngle))	{OLED_DrawPoint(X + x, Y + y);}
	if (OLED_IsInAngle(-x, -y, StartAngle, EndAngle)) {OLED_DrawPoint(X - x, Y - y);}
	if (OLED_IsInAngle(y, x, StartAngle, EndAngle)) {OLED_DrawPoint(X + y, Y + x);}
	if (OLED_IsInAngle(-y, -x, StartAngle, EndAngle)) {OLED_DrawPoint(X - y, Y - x);}
	
	if (IsFilled)	//Ö¸¶¨Ô²»¡Ìî³ä
	{
		/*±éÀúÆðÊ¼µãY×ø±ê*/
		for (j = -y; j < y; j ++)
		{
			/*ÔÚÌî³äÔ²µÄÃ¿¸öµãÊ±£¬ÅÐ¶ÏÖ¸¶¨µãÊÇ·ñÔÚÖ¸¶¨½Ç¶ÈÄÚ£¬ÔÚ£¬Ôò»­µã£¬²»ÔÚ£¬Ôò²»×ö´¦Àí*/
			if (OLED_IsInAngle(0, j, StartAngle, EndAngle)) {OLED_DrawPoint(X, Y + j);}
		}
	}
	
	while (x < y)		//±éÀúXÖáµÄÃ¿¸öµã
	{
		x ++;
		if (d < 0)		//ÏÂÒ»¸öµãÔÚµ±Ç°µã¶«·½
		{
			d += 2 * x + 1;
		}
		else			//ÏÂÒ»¸öµãÔÚµ±Ç°µã¶«ÄÏ·½
		{
			y --;
			d += 2 * (x - y) + 1;
		}
		
		/*ÔÚ»­Ô²µÄÃ¿¸öµãÊ±£¬ÅÐ¶ÏÖ¸¶¨µãÊÇ·ñÔÚÖ¸¶¨½Ç¶ÈÄÚ£¬ÔÚ£¬Ôò»­µã£¬²»ÔÚ£¬Ôò²»×ö´¦Àí*/
		if (OLED_IsInAngle(x, y, StartAngle, EndAngle)) {OLED_DrawPoint(X + x, Y + y);}
		if (OLED_IsInAngle(y, x, StartAngle, EndAngle)) {OLED_DrawPoint(X + y, Y + x);}
		if (OLED_IsInAngle(-x, -y, StartAngle, EndAngle)) {OLED_DrawPoint(X - x, Y - y);}
		if (OLED_IsInAngle(-y, -x, StartAngle, EndAngle)) {OLED_DrawPoint(X - y, Y - x);}
		if (OLED_IsInAngle(x, -y, StartAngle, EndAngle)) {OLED_DrawPoint(X + x, Y - y);}
		if (OLED_IsInAngle(y, -x, StartAngle, EndAngle)) {OLED_DrawPoint(X + y, Y - x);}
		if (OLED_IsInAngle(-x, y, StartAngle, EndAngle)) {OLED_DrawPoint(X - x, Y + y);}
		if (OLED_IsInAngle(-y, x, StartAngle, EndAngle)) {OLED_DrawPoint(X - y, Y + x);}
		
		if (IsFilled)	//Ö¸¶¨Ô²»¡Ìî³ä
		{
			/*±éÀúÖÐ¼ä²¿·Ö*/
			for (j = -y; j < y; j ++)
			{
				/*ÔÚÌî³äÔ²µÄÃ¿¸öµãÊ±£¬ÅÐ¶ÏÖ¸¶¨µãÊÇ·ñÔÚÖ¸¶¨½Ç¶ÈÄÚ£¬ÔÚ£¬Ôò»­µã£¬²»ÔÚ£¬Ôò²»×ö´¦Àí*/
				if (OLED_IsInAngle(x, j, StartAngle, EndAngle)) {OLED_DrawPoint(X + x, Y + j);}
				if (OLED_IsInAngle(-x, j, StartAngle, EndAngle)) {OLED_DrawPoint(X - x, Y + j);}
			}
			
			/*±éÀúÁ½²à²¿·Ö*/
			for (j = -x; j < x; j ++)
			{
				/*ÔÚÌî³äÔ²µÄÃ¿¸öµãÊ±£¬ÅÐ¶ÏÖ¸¶¨µãÊÇ·ñÔÚÖ¸¶¨½Ç¶ÈÄÚ£¬ÔÚ£¬Ôò»­µã£¬²»ÔÚ£¬Ôò²»×ö´¦Àí*/
				if (OLED_IsInAngle(-y, j, StartAngle, EndAngle)) {OLED_DrawPoint(X - y, Y + j);}
				if (OLED_IsInAngle(y, j, StartAngle, EndAngle)) {OLED_DrawPoint(X + y, Y + j);}
			}
		}
	}
}

/*********************¹¦ÄÜº¯Êý*/


/*****************½­Ð­¿Æ¼¼|°æÈ¨ËùÓÐ****************/
/*****************jiangxiekeji.com*****************/
